[
  {
    "slug": "alece-ellis-scholarship",
    "name": "Alece Ellis Scholarship",
    "eligibility": [
      "Must be a graduating senior from any public or private high school in the Kansas City metro region;",
      "Must be pursuing an undergraduate degree or trade certification at an accredited institution;",
      "Must be pursuing the following fields: nursing, speech therapy, music, special education, or education;",
      "Preference will be given to candidates who have demonstrated financial need."
    ],
    "amount": "Up to $1,500 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding if the student continues to meet the criteria for the scholarship. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of Recommendation from a teacher, coach, pastor or mentor (influential adult)."
    ],
    "description": "<p>This scholarship was established as an enduring memorial for Alece Ellis. Alece was a gutsy person who had many different interests and adventures in life. Alece’s initial educational background was in audiology through University of Central Missouri. Later in life, she was successful in pharmaceutical sales. Alece also had an avid interest in equestrian work, professionally judging equestrian shows.</p><p>Alece’s family believes that education is the beginning of the pathway through life and hopes this scholarship will assist students to follow their dreams.</p><p></p>"
  },
  {
    "slug": "alpha-iota-education-foundation-dr-richard-dick-miller-scholarship",
    "name": "Alpha Iota Education Foundation Dr. Richard \"Dick\" Miller Scholarship",
    "eligibility": [
      "Must be a graduating high school senior (or equivalent);",
      "Must be pursuing an undergraduate degree at Missouri University of Science and Technology;",
      "Must have minimum cumulative GPA of 3.0;",
      "Must have demonstrated leadership skills and good character;",
      "Must have demonstrated participation in community service activities;",
      "Preference may be given to members or intended members of the Alpha Iota Chapter of Sigma Pi Fraternity but this is NOT REQUIRED."
    ],
    "amount": "Up to $1,500.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "Applications must be submitted by August 31.",
    "requirements": [],
    "description": "<p>This award was established to recognize and honor Dr. Richard Miller for his service as Faculty Advisor to the men of Sigma Pi Fraternity at Missouri University of Science and Technology from August 1988 through June 2010. During this period, Dr. Miller provided valuable guidance and mentorship to the fraternity and volunteered his time endlessly to inspire service and develop character in our members.</p><p></p>"
  },
  {
    "slug": "alpha-iota-education-foundation-richard-rich-and-ruth-swanson-memorial-scholarship",
    "name": "Alpha Iota Education Foundation Richard \"Rich\" and Ruth Swanson Memorial Scholarship",
    "eligibility": [
      "Must be an active member of the Alpha Iota Chapter of Sigma Pi and be enrolled at the Missouri University of Science and Technology",
      "Must have at least 3 semesters remaining until graduation",
      "Must submit an application form to the Scholarship Chairman",
      "Maintain a minimum GPA of 3.0",
      "Demonstrate the 10 Obligations of Membership as detailed in pledge manual",
      "Exemplify the 5 Ideals of Sigma Pi"
    ],
    "amount": "Up to $5,000.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "Applications must be submitted by August 31.",
    "requirements": [],
    "description": "<p>Rich Swanson was a member of the Alpha Iota Chapter of Sigma Pi. It was an organization in which he and his wife Ruth wished to continue in his absence by virtue of a very generous gift. It is in the memory of that gift, and their philanthropy, that the AIEF established the Rich and Ruth Memorial Scholarship. The scholarship reminds both active Sigma Pi members and alumni of the value of leaving a lasting legacy to those that come after us.</p><p>The intent of this scholarship is to distribute a total of $5,000 per academic year to assist financial need-based in-house member(s) and allow them the opportunity to remain in-house for the following academic year. Recipient(s) will be required to commit to continue in-house residence for the following academic year.</p><p></p>"
  },
  {
    "slug": "association-for-industrial-development-scholarship",
    "name": "Association for Industrial Development Scholarship",
    "eligibility": [
      "Must be a current resident of Eastern Jackson County, Missouri;",
      "Must be a graduating high school senior from Independence, Blue Springs, Ft. Osage, Lee’s Summit, Grain Valley or Raytown schools or an employee of a business located in either of the Truman Road industrial parks in Independence;",
      "Must be pursuing a two or four-year undergraduate degree at any Metropolitan Community College campus or accredited college or university;",
      "Must have a minimum GPA of 2.5 and demonstrated leadership capabilities;",
      "Financial need may be considered."
    ],
    "amount": "May be $500 – $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A letter of reference from a community leader/non-relative (teacher, pastor, employer, scout leader, etc.)"
    ],
    "description": "<p>The Association for Industrial Development (AID) was established in 1970 with the mission of stimulating economic development by creating infrastructure to attract manufacturing business to Independence. During its tenure, the Association acquired land and developed two industrial parks on Truman Road, adding businesses and jobs to the community. Proceeds of the Association’s work were used to establish a scholarship to support Eastern Jackson County students enrolled in higher education and training programs to assure that a technically trained workforce continues to be available.<br></p>"
  },
  {
    "slug": "bess-wallace-truman-scholarship",
    "name": "Bess Wallace Truman Scholarship",
    "eligibility": [
      "Must be a current resident of Independence, Missouri;",
      "Must be a female graduating high school senior attending public, private or home school;",
      "Must be pursuing an undergraduate degree at any accredited college or university;",
      "Must have demonstrated academic merit with a minimum GPA of 2.5, community service experience, school involvement and financial need;",
      "Must NOT be related to a Junior Service League member at the time of initial application. Such restrictions do not apply to renewal applications."
    ],
    "amount": "Up to $2,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding at $1,000 per academic year. A renewal application must be submitted with proof of continuing college enrollment, continuing community service and a minimum college GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $2,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding at $1,000 per academic year. A renewal application must be submitted with proof of continuing college enrollment, continuing community service and a minimum college GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal essay of 500 words maximum, consider your personal qualities and goals for the future. Reflect and elaborate on how your life mirrors some aspect of Bess Wallace Truman's life - her interests, personal qualities, or achievements.",
      "Personal reference from a supervisor of a school activity in which you participated.",
      "Personal reference from a supervisor of a community service activity in which you participated.",
      "A third personal reference, if you choose."
    ],
    "description": "<p>The Bess Wallace Truman Scholarship was created by Junior Service League of Independence to honor the memory of First Lady of the United States, Bess Wallace Truman, who was active in many community service organizations in Independence.<br><br>Mrs. Truman’s daughter, Margaret Truman Daniel, said of her mother:<br><br><i>“She is a woman of tremendous character, which the public may sense, but in addition, she is a warmhearted, kind lady with a robust sense of humor, a merry twinkling wit and a tremendous capacity for enjoying life.”</i><br><br>Junior Service League of Independence trains volunteers for leadership roles, initiates service in response to community needs and offers women opportunities for personal growth.<br></p>"
  },
  {
    "slug": "bill-summa-scholarship",
    "name": "Bill Summa Scholarship",
    "eligibility": [
      "Must be a graduating senior from William Chrisman High School in Independence, Missouri;",
      "Must have four years demonstrated participation in sports at William Chrisman High School;",
      "Must be pursuing an undergraduate degree at any junior college, college or university;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $500.Renewable:Not a renewable scholarship.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $500.Renewable:Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference from a coach."
    ],
    "description": "<p>The Bill Summa Scholarship was established as a tribute to Coach Bill Summa upon his retirement from teaching in the Independence School District in 1988, to provide college education for graduating seniors from William Chrisman High School.<br></p>"
  },
  {
    "slug": "blair-michaela-shanahan-lane-memorial-scholarship",
    "name": "Blair Michaela Shanahan Lane Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from any public high school in Independence, Lee’s Summit, or Raytown, or the following private schools: St. Michael the Archangel High School in Lee’s Summit, St. Teresa's Academy in Kansas City, and Notre Dame de Sion High School in Kansas City.",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must have demonstrated involvement in school activities such as sports or music as well as out-of-school work and community service involvement;",
      "Must have demonstrated perseverance through distressed life circumstances."
    ],
    "amount": "Up to $1,000 per academic year.Renewable:May be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year.Renewable:May be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A typed essay of approximately 500 words that addresses your perseverance through difficult life circumstances, how you feel this perseverance has helped you become stronger, and how you hope to make an impact on other people's lives in the future.",
      "Two personal reference letters. One from a teacher and another from an employer, community service supervisor, or other adult."
    ],
    "description": "<p>Blair Michaela Shanahan Lane was a beloved, big-hearted 11 year old when she passed away in 2011. In Blair’s memory, her family has honored her desire to change the world by providing hope, comfort, support, clothing and other basic necessities to children in distressed situations through a non-profit organization called Blair’s Foster Socks. Blair’s Foster Socks established the Blair Michaela Shanahan Lane Memorial Scholarship in 2016 to build upon Blair’s loving legacy by providing scholarships to students in distressed situations.</p><p></p>"
  },
  {
    "slug": "blue-springs-rotary-club-scholarship-and-presidents-scholarship",
    "name": "Blue Springs Rotary Club Scholarship and President's Scholarship",
    "eligibility": [
      "Must be pursuing an undergraduate degree at any accredited junior college, college, or university or technical certification at any accredited technical school;",
      "Must be a graduating senior from Blue Springs High School, Blue Springs South High School, Valley View High School, or Grain Valley High School;",
      "Must have demonstrated financial need;",
      "Must have demonstrated commitment to community service."
    ],
    "amount": "Up to $2,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "The Blue Springs Rotary Scholarship is not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A typed essay of approximately 500 words elaborating on your personal qualities, career goals, and why you are passionate about community service.",
      "A reference letter from a current teacher, coach or mentor."
    ],
    "description": "<p>The Blue Springs Rotary Club established this scholarship to provide financial assistance to one student with financial need and commitment to community service from Blue Springs High School, Blue Springs South High School, Valley View High School, or Grain Valley High School each year.</p><p></p>"
  },
  {
    "slug": "brandon-gieselman-memorial-4-h-and-ffa-scholarship",
    "name": "Brandon Gieselman Memorial 4-H and FFA Scholarship",
    "eligibility": [
      "Must be a graduating high school senior or college student with membership in a Lafayette County 4-H Club or FFA Chapter;",
      "Must be pursuing an undergraduate degree at an accredited junior college, college, or university;",
      "Must have demonstrated academic excellence;",
      "Must have demonstrated financial need."
    ],
    "amount": "May be $500 – $1,000.Renewable:Not a renewable scholarship.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:May be $500 – $1,000.Renewable:Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Download the Gieselman Scholarship 4-H Information Form or Gieselman Scholarship FFA Information Form to submit when requested."
    ],
    "description": "<p>Brandon Cole Gieselman was born on July 18, 1983. He was the son of Mark and Nancy Gieselman and brother of Tara Gieselman of Lafayette County. Brandon had a zest for life and was an avid outdoorsman and horseman. He was an active member of the Young Riders 4‐H Club and the Lexington FFA Chapter.<br><br>On October 24, 1999, at the age of 16, Brandon tragically lost his life in an automobile accident. In his honor, those who loved Brandon have established this scholarship in his name to provide 4‐H and FFA participants assistance in furthering their education.<br></p>"
  },
  {
    "slug": "centerpoint-medical-center-auxiliary-scholarship",
    "name": "Centerpoint Medical Center Auxiliary Scholarship",
    "eligibility": [
      "Must be pursuing a two or four-year undergraduate degree at an accredited college or university in the Greater Kansas City metropolitan area;",
      "Preference given to residents of Eastern Jackson County or students who are graduates of Eastern Jackson County high schools;",
      "Must be accepted into a healthcare-specific degree program;",
      "Must be a full-time student enrolled in at least 12 credit hours;",
      "Must have earned a minimum of 36 credit hours at time of application;",
      "Must have a minimum GPA of 3.0;",
      "Must have demonstrated participation in extra-curricular, community service, or work-related activities;",
      "Financial need may be considered."
    ],
    "amount": "Minimum of $2,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed up to two additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Essay of 500 words stating what healthcare means to you and how you hope to use your profession to help others.",
      "Letter of Acceptance to a healthcare-related degree program.",
      "Letter of recommendation from someone who can attest to your professional abilities."
    ],
    "description": "<p>The Centerpoint Medical Center Auxiliary established this scholarship to support students in the Greater Kansas City metropolitan area pursuing careers in healthcare.</p><p></p>"
  },
  {
    "slug": "centerpoint-medical-center-medical-staff-scholarship",
    "name": "Centerpoint Medical Center Medical Staff Scholarship",
    "eligibility": [
      "Must be an employee or dependent of an employee of Centerpoint Medical Center;",
      "Must be pursuing a degree related to human healthcare (nursing, pharmacy, radiology, etc.);",
      "Must have a minimum cumulative GPA of 2.5 during the last four semesters of study;",
      "Must have demonstrated participation in community service and/or employment activities;",
      "Must have excellent communication skills (applicants may be asked to complete a phone or personal interview to demonstrate communication skills)."
    ],
    "amount": "Up to $1,000 per academic year.Renewable:Yes, this scholarship may be renewed for three additional years of funding. An application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5 to receive renewal funding.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year.Renewable:Yes, this scholarship may be renewed for three additional years of funding. An application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5 to receive renewal funding."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 202 will n5ot be considered.",
      "Proof of acceptance to a healthcare-specific program at your college or university.",
      "Letter of recommendation from a teacher or supervisor.",
      "Personal Statement essay elaborating on your educational and career goals (approximately 500 words)."
    ],
    "description": "<p>The medical staff of Centerpoint Medical Center established this scholarship to benefit its employees and their families who are pursuing degrees in the human healthcare fields.<br></p>"
  },
  {
    "slug": "christopher-michael-rose-scholarship",
    "name": "Christopher Michael Rose Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from Kansas or Missouri;",
      "Must be pursuing an associate degree or technical certification in a vocational, technical, or trade field;",
      "Must have demonstrated financial need;",
      "Preference given to applicants who come from underserved populations (first-generation Americans, minorities, etc.)"
    ],
    "amount": "Up to $10,000 per academic year with a lifetime total award limit of $20,000.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the student continues to meet the criteria for the scholarship. A renewal application must be submitted with proof of continuing enrollment. Each student is eligible for up to $20,000 total from this scholarship fund over the span of their enrollment."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Three (3) brief letters of recommendation explaining how the applicant meets the criteria for the scholarship and would benefit from receiving it- Two from school staff or faculty and one from a community member, mentor, boss, etc.",
      "Brief essay on the student’s educational and career aspirations. Include details on coming from an underserved community if applicable (first-generation American, minority, etc.). This essay WILL NOT be evaluated on technical writing ability and is only intended for the purposes of learning about the applicants and their hopes and dreams."
    ],
    "description": "<p>This scholarship was established by the family of Christopher Michael Rose to serve as an enduring memorial of his life. Christopher spent his adult life in Aspen, Colorado, and had many friends who worked in the trades in their community. Christopher's family believes he would want to support people with demonstrated financial need pursuing trade certification programs with this scholarship in his name.</p><p></p>"
  },
  {
    "slug": "chuck-jeneen-jones-scholarship",
    "name": "Chuck & Jeneen Jones Scholarship",
    "eligibility": [
      "Must be a member of First Baptist Church of Harrisonville;",
      "Must be pursuing junior or senior year of undergraduate study or any year of seminary school;",
      "Must have cumulative GPA of no less than 2.0."
    ],
    "amount": "Up to $5,000 per academic year, depending on available funding.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship; however, previous recipients may apply again."
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Chuck and Jeneen Jones were 50+ year members of the First Baptist Church of Harrisonville and raised their family in the Church, where Chuck also served as Chief Usher and elder on the Church Council. They were both passionate about public service and the importance of quality education and dedicated much of their lives towards that end.<br><br>Chuck served on the Harrisonville school board for 18 years including six years as President. He also served on the Harrisonville City Council for four years and then as Mayor for a further eight years. Jeneen was a lifelong educator in the Harrisonville School District and inspired three of her four children to become teachers as well.<br><br>Chuck and Jeneen believed that faith and the opportunity for all kids to pursue their dreams through a quality education are the cornerstone keys of our society and established this scholarship fund in order to help as many deserving kids as possible to have that opportunity.</p><p></p>"
  },
  {
    "slug": "corporal-benjamin-ashley-memorial-scholarship",
    "name": "Corporal Benjamin Ashley Memorial Scholarship",
    "eligibility": [
      "Must be a graduating Senior from Truman High School in Independence, Missouri;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college or university;",
      "Must have participated in music-related activities, whether in school or not;",
      "Must have demonstrated participation in community service activities;",
      "Must have a minimum GPA of 2.5."
    ],
    "amount": "Up to $500.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades through Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "At least one personal reference from a supervisor of a school activity you participated in."
    ],
    "description": "<p>Benjamin James Thomas Ashley was born July 7, 1984, to Kenneth and Donna Ashley. Benjamin was full of love and service for others from the time he was a little boy. He was always the defender of the underdog or those society shunned because they were different. His love for mankind had no barriers.<br><br>Benjamin began playing the alto saxophone in the 6th grade and continued participating in musical activities at Truman High School, including marching band, concert band, symphonic band, and jazz band. Benjamin was also active in the choir and youth activities at Oak Grove Community of Christ He was an Eagle Scout and participated in various athletic programs, graduating from Truman High School in 2002.</p><p>On March 31, 2004, Benjamin fulfilled a dream he’d had since he was five years old and enlisted in the United States Army. On July 25th of that same year, he married Kassandra Kay Kistner, also a 2002 graduate of Truman High School. On October 4, 2006, he left with his unit for Camp Anaconda, Iraq, where he was stationed when his vehicle hit an IED on May 24, 2007.</p><p>Benjamin is survived by his wife, Kassandra; son, Alexander Gage; parents, Ken and Donna Ashley; and sister, Khristin Ashley Dutzel. His family and friends have established this scholarship as a lasting legacy to honor the legacy of a fallen soldier who served his country faithfully. This scholarship will support college education for graduating seniors from Truman High School who exemplify his character by demonstrating a strong faith, a love for music and a commitment to the service of others.<br></p>"
  },
  {
    "slug": "council-of-clubs-of-greater-kansas-city-scholarship",
    "name": "Council of Clubs of Greater Kansas City Scholarship",
    "eligibility": [
      "Must be pursuing a certification or degree at an accredited trade school, junior college, college or university that is located within a 50-mile radius of Tenth and Main Streets in Kansas City, Missouri;",
      "Must have maintained a B average (3.0 GPA) for the previous semester;",
      "Must have demonstrated leadership potential as evidenced by leadership positions held in extra-curricular groups, committees, community service groups, etc."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p>The purpose of the Council of Clubs is to encourage and promote educational development through financial assistance to young people. In keeping with this mission, the Council of Clubs of Greater Kansas City is proud to sponsor this scholarship to assist students in the metropolitan Kansas City area in obtaining formal education. This scholarship funds all fields of study at all levels including undergraduate, graduate, technical, professional and trade education.</p><p></p>"
  },
  {
    "slug": "daniel-l-bodas-technical-scholarship",
    "name": "Daniel L. Bodas Technical Scholarship",
    "eligibility": [
      "Must be a graduating senior from Rock Ridge High School in Virginia, Minnesota;",
      "Must have demonstrated financial need;",
      "Must be pursuing a technical certification or associates of applied sciences degree at an accredited institution;",
      "Preference will be given to students pursuing certification or degrees in automotive or aviation mechanics.",
      "Please note that there is NO minimum academic performance (GPA, ACT Score, Class Rank, etc.) required to be eligible for this scholarship, even though the application includes questions about academics. This scholarship is intended for students who are pursuing trade careers."
    ],
    "amount": "Up to $3,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for one additional year of funding. A third year of funding will be considered on a case-by-case basis. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.0."
    },
    "deadline": "",
    "requirements": [
      "Resume: Attach a resume detailing school-related activities, community involvement, work history, and/or family responsibilities;",
      "High school transcript for grades 9 - 12 with GPA and grading scale;",
      "FAFSA Student Aid Report showing Expected Family Contribution amount;",
      "Reference Letter from your industrial technology (or similar trade) teacher;",
      "Personal Essay: Attach an essay of approximately 500 words that details your passion for your planned career field."
    ],
    "description": "<p>Mrs. Jan Bodas established this scholarship in loving memory of her husband, Daniel L. Bodas, to benefit students graduating from Rock Ridge High School in Virginia, Minnesota, who are pursuing technical trade certifications or associates of applied sciences degrees. Preference will be given to applicants pursuing automotive or aviation mechanics.</p><p>Dan graduated from Gilbert High School in 1963 and joined the United States Air Force the next day. He served as a jet engine mechanic and engine test cell specialist in England and Libya. After his term of service in the Air Force, Dan lived an adventuresome life working in aviation mechanics all over the world, including Turkey, Ethiopia, Venezuela, Colombia, Guyana, Suriname, the Antilles, India, Nepal, Sri Lanka, Spain, Portugal, Majorca, and the Azores. After his career, he retired to his farm in the Ozarks to hunt and fish.</p><p>Dan was a beloved husband, a modest and generous man, and he lived each day by his personal motto, “Just keep going.” Mrs. Bodas hopes that this scholarship in Dan’s memory will lead to opportunity and adventure for future generations of mechanics in all fields.</p><p></p>"
  },
  {
    "slug": "david-a-cromwell-memorial-scholarship",
    "name": "David A. Cromwell Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Blue Springs or Blue Springs South High School in Blue Springs, Missouri;",
      "Must be pursuing an undergraduate degree at a four year public university in the state of Missouri."
    ],
    "amount": "Up to $1,000.Renewable:Not a renewable scholarship.Deadlines:",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000.Renewable:Not a renewable scholarship.Deadlines:"
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p>David Cromwell was a 2003 graduate of Blue Springs South High School. He was enrolled at the University of Missouri-Columbia and planned to start classes in the fall of 2004. David died in a tragic accident six weeks after his high school graduation.<br><br>David had a love of life, learning and humanity. It is the wish of his family and friends that his dream of attending college live on by helping others achieve their educational goals with the help of this scholarship fund established to honor David’s memory.<br></p>"
  },
  {
    "slug": "david-hurt-memorial-scholarship",
    "name": "David Hurt Memorial Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from the Hannibal or Lee's Summit school districts;",
      "Must be pursuing an undergraduate degree in engineering at any accredited junior college, college, or university;",
      "Must have demonstrated financial need;",
      "Must have demonstrated leadership skills and good character."
    ],
    "amount": "May be $500 - $1,000 depending on funding.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a supervisor of an activity included in the resume submitted as part of the application."
    ],
    "description": "<p>David A. Hurt was born and raised in Hannibal, Missouri. He graduated from the University of Missouri with a Bachelor of Science in Civil Engineering. He and his wife Stacy raised their two sons, Cameron and Andrew, in Lee's Summit.</p><p>David spent his career at Burns &amp; McDonnell Engineering. He was very enthusiastic about planning and designing transportation projects including highways, bridges, and trails. Throughout his career, he was a mentor to many.</p><p>He had a love of life, a zest for learning, and a strong sense of community. His connection to his hometown of Hannibal and the Lee's Summit area, where his family placed their roots, has built a strong foundation and interest in the success of those in both communities.</p><p>The David Hurt Memorial Scholarship was established by his family and friends to honor his legacy. It is the hope that through the support of this scholarship, graduates of both Hannibal Senior High School and Lee's Summit R-7 High Schools with a passion for Engineering will achieve their educational goals.</p><p></p>"
  },
  {
    "slug": "david-sennewald-costello-scholarship",
    "name": "David Sennewald Costello Scholarship",
    "eligibility": [
      "Must be a high school graduate, GED holder, or graduating high school senior",
      "Preference will be given to those who earned a minimum 2.0 cumulative GPA in high school",
      "Must be pursuing flight training at ATD Pilot Training LLC to obtain an airplane pilot’s license, certification, or rating.",
      "Preference will be given to students with demonstrated financial need."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "",
    "requirements": [
      "Resume",
      "Personal Statement Essay elaborating on your educational and career goals and why you feel you should be selected to receive a scholarship",
      "Transcripts showing grades through Fall Semester 2025"
    ],
    "description": "<p>This scholarship was established to serve as an enduring memorial and legacy for David Sennewald Costello.</p>"
  },
  {
    "slug": "drexel-public-school-foundation-scholarships",
    "name": "Drexel Public School Foundation Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages all Drexel Public School Foundation’s scholarship funds. Eligible applicants must be graduating seniors of Drexel High School.<br><br>For more information, please contact <a href=\"mailto:cthere4u@yahoo.com?subject=Drexel%20School%20scholarships\">Chris Collins</a> or <a href=\"tel:8169858964\">(816) 985-8964</a>.</p>"
  },
  {
    "slug": "drs-kurt-hanneman-elizabeth-ward-health-sciences-scholarship",
    "name": "Drs. Kurt Hanneman & Elizabeth Ward  Health Sciences Scholarship",
    "eligibility": [
      "Must be a graduating senior from Grain Valley High School;",
      "Must be pursuing an undergraduate or degree or technical certification program in a dental or healthcare related field;",
      "Preference may be given to candidates pursuing dental careers (dentistry, dental assisting, dental hygiene, dental laboratory technicians);",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $1,200 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "",
    "requirements": [
      "Essay of 500 words briefly explaining your career goals.",
      "Letter of reference."
    ],
    "description": "<p>This scholarship was established by Drs. Kurt Hanneman and Elizabeth Ward to provide financial support for students from Grain Valley, MO, who are pursuing careers in dentistry or healthcare.&nbsp;</p>"
  },
  {
    "slug": "edward-l-and-helen-l-newlin-scholarship",
    "name": "Edward L. and Helen L. Newlin Scholarship",
    "eligibility": [
      "Must be a graduating senior from a public high school in one of the following school districts: Fort Osage, Grain Valley, Oak Grove or Raytown;",
      "Must be pursuing an undergraduate degree at any accredited four year college or university."
    ],
    "amount": "Up to $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from at least one supervisor of an activity included in the resume you previously submitted. Up to two more references may be submitted, if you choose."
    ],
    "description": "<p>The Edward L. and Helen L. Newlin scholarship was established in 2006 by Edward and Helen Newlin of Oak Grove, Missouri, to provide college education for worthy young men and women of Eastern Jackson County.<br></p>"
  },
  {
    "slug": "elizabeth-weekley-sutton-scholarship",
    "name": "Elizabeth Weekley Sutton Scholarship",
    "eligibility": [
      "Must be a graduating senior from North Kansas City High School or Oak Park High School; or from a public high school in Blue Springs, Fort Osage, Grain Valley, Independence, Lee’s Summit, Oak Grove or Raytown school districts;",
      "Must be pursuing an undergraduate degree in Family and Consumer Sciences or any of its knowledge-based areas (specific university departments/majors may be named differently);",
      "Must have demonstrated strong morals;",
      "Must have demonstrated leadership and community service;",
      "Must have a minimum cumulative GPA of 3.0."
    ],
    "amount": "May be $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:May be $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference from a teacher or counselor."
    ],
    "description": "<p>Elizabeth Weekley Sutton was a home economics teacher for 30 years and was very active in her profession. She taught in the North Kansas City Schools for 28 years, teaching at North Kansas City High School for 12 years and at Oak Park High School for 16 years. As part of her legacy gift to Truman Heartland Community Foundation, Mrs. Sutton created this scholarship to honor students pursuing careers in Family and Consumer Sciences and its knowledge-based areas, including:</p><ul><li>Family and Consumer Sciences Education;</li><li>Dietetics, Nutrition, Health and Food Management;</li><li>Human Development and Family Relations;</li><li>Apparel Design, Textiles and Merchandising;</li><li>Housing and Development;</li><li>Child Development;</li><li>Education;</li><li>Consumer Economics and Resource Management;</li><li>Family and Consumer Sciences Education Extension; and</li><li>Issues related to the above subject areas.</li></ul><p></p>"
  },
  {
    "slug": "emily-kirk-memorial-scholarship",
    "name": "Emily Kirk Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Blue Valley West High School in Overland Park, Kansas;",
      "Must be pursuing an undergraduate degree in nursing or any medical field at any accredited four-year college or university;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "March 16, 2026.",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a supervisor of an activity that is included in the resume submitted as part of the application",
      "Personal Statement essay about your educational and career goals (approximately 500 words)",
      "FAFSA Student Aid Index",
      "Letter of Recommendation"
    ],
    "description": "<p>Emily Kirk graduated from Blue Valley West High School in 2019. After taking anatomy and participating in the CAPS program, she earned her CNA through the CAPS Clinical Experiences class and went on to work as a CNA at a local nursing home, solidifying her plan to become a nurse.</p><p>Emily attended University of Missouri- Columbia, majoring in nursing and working as a CNA in the neurology department at a university hospital. She was active in the Phi Beta Phi sorority, the Catholic Newman Center, CARS elementary school reading volunteer program, and the campus nursing club. Emily was a sophomore when she passed away suddenly on December 11, 2020, from a pulmonary embolism.</p><p>Emily was a very compassionate person, always seeking to connect with and help others, including her friends, family, and patients. Her family and friends established this scholarship to honor her memory and support others in achieving a degree in the medical field.</p><p></p>"
  },
  {
    "slug": "eugene-j-rolfe-memorial-scholarship",
    "name": "Eugene J. Rolfe Memorial Scholarship",
    "eligibility": [
      "Must be a graduate of a high school in the Lee’s Summit Public School District, St. Michael the Archangel High School in Lee's Summit, or a home school graduate residing in Lee's Summit or the Lee's Summit School District boundaries;",
      "Must be pursuing an undergraduate degree in the field of engineering at any junior college, college or university accredited by the Accreditation Board for Engineering and Technology (ABET) within the United States;",
      "Must have a demonstrated participation in music, either vocal or instrumental;",
      "Must have a minimum cumulative GPA of 3.0."
    ],
    "amount": "Up to $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,500 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference from a supervisor of a school activity in which you participated.",
      "Personal reference from a teacher.",
      "Personal reference from a non-family, community member who can verify your musical interest and participation."
    ],
    "description": "<p>Eugene “Gene” J. Rolfe, was born in St. Louis, Missouri. Gene grew up with a love of music and a desire to understand the world around him. His love of music could be seen as he played clarinet in his high school band and gave guitar lessons throughout high school, college and even after graduating from college. He played guitar in “garage bands” throughout his life and was a longtime member of his church choirs.<br><br>Gene’s desire to understand the world around him led him to building, repairing, filming and exploring the physics of the world around him. He majored in both physics and chemistry in college before landing on electrical engineering. He graduated from the University of Missouri-Columbia in 1976, with a bachelor’s degree in Electrical Engineering. He went on to receive his master’s degree in Electrical Engineering from MU in 1978.<br><br>Gene worked throughout his career for the same company in Kansas City, moving through various positions and into management. His desire to teach extended beyond music and into engineering. He taught various computer programming courses for many years at Longview Community College in addition to continuing his engineering career. This love of teaching led him to work on his Ph.D. in Engineering and Networking at the University of Missouri-Kansas City. His goal was to eventually retire from his job and take up teaching engineering at the university level. On a night in February, 1999, he was on his way to a class for his Ph.D. program when he was killed by a drunk driver.<br><br>This scholarship was established by Gene’s family to honor the traits that they loved in Gene and to encourage the same areas of interest in young people, just as Gene did by teaching those subjects.<br></p>"
  },
  {
    "slug": "forrest-and-marjorie-martin-graduate-scholarship",
    "name": "Forrest and Marjorie Martin Graduate Scholarship",
    "eligibility": [
      "Must have been a resident of Eastern Jackson County for the past 12 months or a high school graduate of any public or private high school in the Blue Springs, Fort Osage, Grain Valley, Grandview, Independence, Lee’s Summit, Lone Jack, Oak Grove or Raytown school districts;",
      "Must be planning to be enrolled as a full-time graduate student with a minimum of nine credit hours at an accredited four-year college or university;",
      "Must have demonstrated financial need;",
      "Must have a minimum cumulative college GPA of 3.0."
    ],
    "amount": "Up to $4,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for one additional year (two semesters) of funding. A renewal application must be submitted with proof of continuing graduate school enrollment and a minimum cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A letter of reference"
    ],
    "description": "<p>The Forrest and Marjorie Martin Scholarships were established as a bequest from the Marjorie N. Martin Trust and Forrest Martin Marital Trust in 2007. The Graduate Scholarship provides assistance to Eastern Jackson County residents who are full-time graduate students enrolled in at least nine credit hours at any accredited college or university.</p><p></p>"
  },
  {
    "slug": "forrest-and-marjorie-martin-technical-scholarship",
    "name": "Forrest and Marjorie Martin Technical Scholarship",
    "eligibility": [
      "Must have been a resident of Eastern Jackson County for the past 12 months or a high school graduate of any public or private high school in the Blue Springs, Fort Osage, Grain Valley, Grandview, Independence, Lee’s Summit, Lone Jack, Oak Grove or Raytown school districts;",
      "Must have demonstrated financial need;",
      "Must be admitted to a one year trade certificate program or have a minimum cumulative GPA of 2.5 going into the second year of an Associate of Applied Science degree at an accredited junior college, college or university."
    ],
    "amount": "Up to $2,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference."
    ],
    "description": "<p>The Forrest and Marjorie Martin Scholarships were established as a bequest from the Marjorie N. Martin Trust and Forrest Martin Marital Trust in 2007. The Technical Scholarship provides assistance to Eastern Jackson County residents pursuing technical trade certifications or associate’s degrees.</p><p></p>"
  },
  {
    "slug": "forrest-and-marjorie-martin-undergraduate-scholarship",
    "name": "Forrest and Marjorie Martin Undergraduate Scholarship",
    "eligibility": [
      "Must have been a resident of Eastern Jackson County for the past 12 months or a high school graduate of any public or private high school in the Blue Springs, Fort Osage, Grain Valley, Grandview, Independence, Lee’s Summit, Lone Jack, Oak Grove or Raytown school districts;",
      "Must be currently enrolled as a full-time student with a minimum 12 credit hours at an accredited four-year college or university;",
      "Must have successfully completed a minimum of 36 credit hours at the time of application;",
      "Must have demonstrated financial need;",
      "Must have a minimum cumulative GPA of 2.5."
    ],
    "amount": "Up to $4,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for one additional year (two semesters) of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of reference."
    ],
    "description": "<p>The Forrest and Marjorie Martin Scholarships were established as a bequest from the Marjorie N. Martin Trust and Forrest Martin Marital Trust in 2007. The Undergraduate Scholarship provides assistance to Eastern Jackson County residents who are full-time students with at least 36 earned credit hours.</p><p></p>"
  },
  {
    "slug": "for-osage-resources-champion-education-force-scholarships",
    "name": "Fort Osage Resources Champion Education (FORCE) Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages FORCE scholarship funds. Eligible applicants must be graduating seniors of Fort Osage High School.<br><br>For more information, please contact the Fort Osage HS Counseling Office.</p>"
  },
  {
    "slug": "gene-and-joanne-cable-scholarship",
    "name": "Gene and Joanne Cable Scholarship",
    "eligibility": [
      "Must be graduating high school seniors from Truman, William Chrisman, Van Horn, Blue Springs South, or Lee's Summit North High Schools or graduating seniors having completed a program at Lex La-Ray Technical Center;",
      "Must have demonstrated participation in school activities such as sports and debate;",
      "Must have demonstrated participation in out-of-school activities such as work and community service;",
      "Must have a minimum cumulative GPA of 2.5."
    ],
    "amount": "Year 1- $2,500Year 2- $2,750Year 3- $3,000Year 4- $3,250",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "At least one personal reference from a supervisor of an activity you listed on your resume."
    ],
    "description": "<p>Gene and Joanne Cable, owners of Cable Chevrolet for nearly 40 years, have actively served and supported the Eastern Jackson County region both with talent and treasure. As a young married couple, Gene and Joanne moved to Independence in 1956, and became involved in business and civic life. Gene served as a member of the original Independence City Charter Commission and became President of the Independence Rotary Club. Joanne joined Junior Service League in 1959, and became an active volunteer with many charitable organizations that involved children and the arts.<br><br>The Cables established this scholarship to help the youth of our community attain the skills needed for a good future. They recognize the importance of a good education and enjoy helping others prepare for their futures.<br></p>"
  },
  {
    "slug": "gene-cable-automotive-scholarship",
    "name": "Gene Cable Automotive Scholarship",
    "eligibility": [
      "Must be enrolling full-time in the Associate in Applied Science degree program in Automotive Technology at MCC-Longview;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $5,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship may be renewed for an additional year of funding if candidate submits a renewal application including documentation of earning a minimum 2.0 GPA and continued enrollment."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Resume: Attach a resume detailing school-related activities, community involvement, work history, and/or family responsibilities;",
      "FAFSA Student Aid Report showing Student Aid Index amount;",
      "Personal Essay: Attach an essay of approximately 500 words that details your passion for the automotive career field. Please note that this essay WILL NOT be judged on technical writing capability and is only intended for the purpose of learning about you and your hopes and dreams."
    ],
    "description": "<p>Gene Cable, owner along with his wife Joanne, of Cable Chevrolet for nearly 40 years, actively served and supported the Eastern Jackson County region both with talent and treasure until his passing in 2022 at the age of 96. Gene and Joanne’s leadership and financial contributions to the community are numerous and led to great respect and admiration from many.</p><p>Joanne established this scholarship in memory of Gene in the hopes that it will support others who are pursuing careers in the automotive industry.</p><p></p>"
  },
  {
    "slug": "george-and-ellen-jane-petrie-scholarship",
    "name": "George and Ellen Jane Petrie Scholarship",
    "eligibility": [
      "Must be pursuing an undergraduate degree in elementary or secondary education at UCM, UMKC, or Truman State;",
      "Must have earned at least 24 college credit hours at the time of application;",
      "Must have a cumulative college GPA of 2.5 or above;",
      "Preference may be given to graduates of Blue Springs, Raytown, or Hickman Mills high schools."
    ],
    "amount": "Up to $1,000 per academic year.Renewable:",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year.Renewable:"
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A typed essay of approximately 500 words elaborating on your personal qualities, goals for the future and why you are pursuing a career in education.",
      "A reference letter from a current faculty member, advisor or activity sponsor."
    ],
    "description": "<p>The George and Ellen Jane Petrie Scholarship was established by the Petrie family in honor of their parents. Both George and Ellen Jane were educators - George taught high school music in the Blue Springs and Raytown School Districts, and Music Therapy at UMKC after earning his PhD in Education; Ellen Jane taught business in the Hickman Mills and Raytown School Districts. Both cared deeply for their students and understood that it takes a resilient, passionate, and empathetic person to become a teacher. This scholarship has been established to support and encourage just this type of future educator.&nbsp;<br></p>"
  },
  {
    "slug": "glenda-k-dowler-memorial-scholarship",
    "name": "Glenda K. Dowler Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Lee’s Summit North High School in Lee’s Summit, Missouri;",
      "Must be pursuing a degree at an accredited college or university, community college, trade school or other approved job skill certification or training program;",
      "Must have demonstrated participation in school activities such as sports or out-of-school activities such as work or community service;",
      "Must have demonstrated financial need;",
      "Must have cumulative GPA between 2.0 and 3.5."
    ],
    "amount": "Up to $1,000 per academic year.Renewable:Not a renewable scholarship.Deadlines:",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year.Renewable:Not a renewable scholarship.Deadlines:"
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a teacher or supervisor."
    ],
    "description": "<p>Mrs. Glenda K. Dowler was an educator passionate about her students. She always sought to bring out the best in each individual. Her expectations were unwavering, and for Mrs. Dowler’s students, failure was not an option. She spent countless hours mentoring students and making phone calls to parents. She knew that not all students were “A” students but that all students could succeed in the classroom if given the right tools. Mrs. Dowler hoped to give all students the opportunity to become productive members of society.<br><br>In honor of Mrs. Dowler’s dedication to her students, a scholarship established by her family will be awarded to deserving Lee’s Summit North High School graduating seniors.<br></p>"
  },
  {
    "slug": "grain-valley-school-district-foundation-scholarships",
    "name": "Grain Valley School District Foundation Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages Grain Valley School District Foundation’s scholarship funds. Eligible applicants must be graduating seniors from Grain Valley High School.<br><br>For more information, please contact the Grain Valley High School Counseling Center.</p>"
  },
  {
    "slug": "greater-kansas-city-association-of-family-and-consumer-science-scholarship",
    "name": "Greater Kansas City Association of Family and Consumer Science Scholarship",
    "eligibility": [
      "Must be a current resident of Kansas or Missouri;",
      "Must be a junior or senior at an accredited college or university;",
      "Must be pursuing an undergraduate degree in Family and Consumer Sciences or any of its knowledge-based areas listed above (specific university departments/majors may be named differently);",
      "Must be enrolled in a minimum of nine credit hours;",
      "Must have average or above-average scholastic standing."
    ],
    "amount": "May be $1,000 - $2,000.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "Applications must be submitted by April 1.",
    "requirements": [],
    "description": "<p>This scholarship fund is sponsored by the Greater Kansas City Association of Family and Consumer Sciences to provide scholarships for students pursuing undergraduate degrees in Family and Consumer Sciences and its knowledge-based areas:</p><ul><li>Family and Consumer Sciences Education;</li><li>Dietetics, Nutrition, Health and Food Management;</li><li>Human Development and Family Relations;</li><li>Apparel Design, Textiles and Merchandising;</li><li>Housing and Development;</li><li>Child Development;</li><li>Consumer Economics and Resource Management;</li><li>Family and Consumer Sciences Education Extension; and</li><li>Issues related to the above subject areas.</li></ul><p></p>"
  },
  {
    "slug": "gregory-a-knapp-train-your-brain-scholarship",
    "name": "Gregory A. Knapp Train Your Brain Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from any public or private high school in Blue Springs, Grain Valley, Independence, Lee’s Summit, or Raytown;",
      "Must be pursuing a technical certification or undergraduate degree at any accredited junior college, college, or university."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a supervisor of an activity included in the resume submitted as part of application."
    ],
    "description": "<p></p>"
  },
  {
    "slug": "harold-h-norma-j-and-james-allan-jimmy-schmidt-scholarship",
    "name": "Harold H., Norma J., and James Allan (Jimmy) Schmidt Scholarship",
    "eligibility": [
      "Must be a graduating senior from a Ray County, Missouri High School; Hardin-Central, Lawson, Orrick, or Richmond;",
      "Must be an active member of a Baptist Church;",
      "Must have demonstrated financial need;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must be pursuing an undergraduate degree at any accredited college or university;"
    ],
    "amount": "Up to $5,000 per academic year. Renewable: Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $5,000 per academic year. Renewable: Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference from a supervisor of an activity in which you participated",
      "Personal reference from a pastor who can substantiate your involvement in a Baptist Church.",
      "A third personal reference, if you choose."
    ],
    "description": "<p>The Harold H., Norma J., and James Allan (Jimmy) Scholarship was established through a bequest from the Schmidt family. This scholarship is to benefit graduating high school seniors from Ray County, Missouri.</p><p></p>"
  },
  {
    "slug": "harry-and-connie-katowitz-memorial-scholarship",
    "name": "Harry and Connie Katowitz Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Truman, Van Horn, William Chrisman or Fort Osage High School in Independence, MO;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated financial need;",
      "Must be pursuing an undergraduate degree from an accredited public college or university in one of the following fields: Business, Economics, Education, Nursing, Public Health, Social Work;",
      "Must have demonstrated participation in community service, school activities, and out-of-school activities (such as Scouting, club sports, or music)."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "May be renewed for three additional years of funding if applicant continues to meet the above eligibility criteria. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A typed essay of approximately 500 words that addresses your involvement in community service, what it has meant to you, and how you hope to make an impact in other people's lives in the future.",
      "At least two personal reference letters, one from a teacher and one from an employer. You may attach a third reference letter, if you choose."
    ],
    "description": "<p>Harry and Connie Katowitz were lifelong residents of Jackson County, MO, and were very active in their community. In addition to founding and owning Katco Rubber and Supply Company in Independence, Harry was a member of the Sugar Creek Optimist Club and the Eagles Club, and Connie was a member of the American Business Women's Association, the Ladies' Oriental Shrine, and the Bingham-Waggoner Estate. Harry and Connie were also members of the Truman Library for many years. The Katowitzes cared deeply for children, sponsoring youth baseball and basketball teams and supporting the Boys and Girls Clubs for many years. The Katowitz family established this scholarship to honor Harry and Connie's legacy of supporting young people in the community.</p><p>For 2021, special consideration may be given to those applicants pursuing education, nursing, public health, or social work. This year, the family feels it is important to focus on those applicants interested in being the \"helpers\" Mr. Rogers referred to in his famous quote, \"Look for the helpers. You will always find people who are helping.\"</p><p></p>"
  },
  {
    "slug": "heart-of-a-tiger-scholarship",
    "name": "Heart of a Tiger Scholarship",
    "eligibility": [
      "Must be a graduating senior from Lee's Summit High School;",
      "Must be a current baseball player at Lee’s Summit High School;",
      "Must be pursuing an undergraduate degree at any junior college, college or university or certification program from a technical training institution;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $500.Renewable:Not a renewable scholarship.Deadlines:",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $500.Renewable:Not a renewable scholarship.Deadlines:"
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Some forty years ago, a young man was approaching his high school graduation date. He didn’t know what he wanted to do with his life, except he knew he wanted to play baseball. He received a $200 scholarship to enroll in junior college to play baseball. He went on to play baseball for a four-year university, be named a college All-American, play professional baseball for five years, and coach collegiate women’s softball. The young man’s family believes that none of his success would have been possible without the generous scholarship he received. They established this scholarship to pay that gift forward to the next generation of high school baseball players from Lee’s Summit High School.</p><p></p>"
  },
  {
    "slug": "independence-young-matrons-scholarship",
    "name": "Independence Young Matrons Scholarship",
    "eligibility": [
      "Must be a current resident of Eastern Jackson County, Missouri (East of I-435);",
      "Must be a graduating senior or past graduate of an Eastern Jackson County high school;",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college, or university."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [],
    "description": "<p>The Young Matrons of Independence, Missouri, have established this scholarship to assist Eastern Jackson County residents pursuing undergraduate degrees.</p><p></p>"
  },
  {
    "slug": "jackson-county-columbian-homes-association-knights-of-columbus-council-3430-legacy-scholarship",
    "name": "Jackson County Columbian Homes Association Knights of Columbus Council 3430 Legacy Scholarship",
    "eligibility": [
      "Must be enrolled at St. Michael the Archangel High School in Lee's Summit;",
      "Must have demonstrated financial need based on completion of FACTS Tuition application;",
      "Must be a current resident of Independence or Sugar Creek, an active parishioner of St. Mary's, OR a legacy family of St. Mary's High School."
    ],
    "amount": "To be determined based on number of applicants and endowment funds available.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>This scholarship serves as an enduring legacy for the Jackson County Columbian Homes Association Knights of Columbus Council 3430.&nbsp;</p><p></p>"
  },
  {
    "slug": "jason-stone-creativity-scholarship",
    "name": "Jason Stone Creativity Scholarship",
    "eligibility": [
      "Must be a graduating senior from any public high school in Independence, Blue Springs, Fort Osage or Lee’s Summit, Missouri, school districts;",
      "Must be pursuing a visual art or art education undergraduate degree at any accredited junior college, college or university;",
      "Must have a minimum cumulative GPA of 2.0;"
    ],
    "amount": "Up to $1,000 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment in art and a minimum college cumulative GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment in art and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "One original art piece.",
      "Short statement about why you chose the piece you submitted and what it took to create it.",
      "Personal reference from a supervisor or teacher in your creative field.",
      "A second personal reference, if you choose."
    ],
    "description": "<p>Jason Stone attended Blue Springs schools and graduated from Eastern Jackson County Alternative High School in 1993. Throughout his 31 years, he was an artist and poet. Jason had a sweet smile and steadfast courage in the face of adversity. He was a curious person, and when something caught his imagination, he immersed himself in it. His kind and gentle spirit touched all who knew him. His art and poetry embody a full, complex and profound life. His family has established this scholarship as a lasting legacy to honor Jason’s extraordinary talent and to inspire future artists and poets for years to come.<br><br>New Room, by Jason Stone<br><br><i>The wind howls</i><br><i>as I paint a tornado of color,</i><br><i>dark shaded circles of red and purple.</i><br><br><i>Twirling and tumbling across the walls,</i><br><i>floor and ceiling.</i><br><i>My soul being warm would be the feeling.</i><br><br><i>Color and designs</i><br><i>Would overwhelm the viewer</i><br><i>as it would be a shrine</i><br><i>to the human spirit and its potential.</i><br><br><i>With windows comparing</i><br><i>and contrasting its form</i><br><i>a new room would be born.</i><br></p>"
  },
  {
    "slug": "jay-mcnamara-memorial-scholarship",
    "name": "Jay McNamara Memorial Scholarship",
    "eligibility": [
      "• Must be enrolled in St. Michael the Archangel High School in Lee’s Summit for the following school year"
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship. Previous recipients may apply again."
    },
    "deadline": "Applications must be submitted by April 1. Completed applications can be emailed to watkins@thcf.org.",
    "requirements": [],
    "description": "<p>The Jay McNamara Memorial Scholarship Fund was established in 2020 by the McNamara family to provide scholarships to students attending St. Michael the Archangel Catholic High School in Lee’s Summit, MO. Jay McNamara had a passion for life, and his generous heart touched so many. At the early age of 43, Jay passed away from coronary artery disease that had gone undiagnosed. Jay was a 1993 graduate of Archbishop O’Hara High School. His family and friends want to continue to honor Jay’s legacy of love through this scholarship.</p>"
  },
  {
    "slug": "jim-scheerer-memorial-scholarship",
    "name": "Jim Scheerer Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Raytown High School",
      "Must be pursuing an automotive technician or mechanic trade certification or degree",
      "Preference will be given to students with outstanding academic achievement"
    ],
    "amount": "Up to $1,500 per academic year",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship may be renewed for an additional year of funding if candidate submits a renewal application including documentation of earning a minimum 3.0 GPA and continued enrollment."
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades through Fall Semester 2025"
    ],
    "description": "<p>Jim Scheerer was a Raytown resident and 1961 graduate of Raytown High School. Following graduation, he started working for Western Electric in Lee's Summit, where he worked for 35+ years, operating machinery that made components for telephones and phone lines. His life passion was working on and racing cars, which began in his teenage years and continued throughout his adult life.&nbsp;</p><p>After retiring from his longtime job, he and a partner opened Missouri Performance Outlet in Blue Springs, which operated for 10+ years as a source of street and race car parts, race fuel, nitrous, and car related shenanigans. During his racing career he set multiple national records, won dozens of trophies, and many race events, including track and/or season championships. Highlights of his racing career include being the only racer known to compete at the first event at Kansas City International Raceway (KCIR) in the 60's and the last event in 2011, and winning his eliminator class in the KCIR AHRA national event in 1969.</p><p>This scholarship was established by the Scheerer family as an enduring memorial and legacy for Jim Scheerer. &nbsp;</p>"
  },
  {
    "slug": "john-f-bowser-radiology-scholarship",
    "name": "John F. Bowser Radiology Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Eligible applicants must be pursuing a degree in Radiologic Technology at Avila University through United Imaging Consultants (UIC) and Centerpoint Medical Center.<br></p><p>Contact Tanya Dodge, BBA RT (R)(CT), Imaging Director, Centerpoint Medical Center at tanya.dodge@hcamidwest or 816-698-7132.<br><br></p>"
  },
  {
    "slug": "john-s-barrett-memorial-scholarship",
    "name": "John S. Barrett Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Lathrop High School in Lathrop, Missouri;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college or university;",
      "Must have a minimum cumulative GPA of 3.0 or an ACT score of 21 or above."
    ],
    "amount": "Up to $1,000.Renewable:Not a renewable scholarship.Deadline:Applications must be submitted by April 15.Apply:For application information, please see counselors at Lathrop High School.",
    "renewable": {
      "isRenewable": false,
      "details": "Up to $1,000.Renewable:Not a renewable scholarship.Deadline:Applications must be submitted by April 15.Apply:For application information, please see counselors at Lathrop High School."
    },
    "deadline": "Applications must be submitted by April 15.Apply:For application information, please see counselors at Lathrop High School.",
    "requirements": [],
    "description": "<p>John S. Barrett, Sr. was born in Kansas City, Missouri. He served as a military police officer during the Vietnam War and was a 25-year veteran police officer with the Kansas City, Missouri, Police Department.</p><p>After retirement, John served the community of Lathrop, Missouri, as a member of the Lathrop Board of Education, the Rural Water District Board of Directors, the Lathrop Fire Protection District Board of Directors and the Lathrop Rotary Club.<br><br>John was a man that understood the value of a good education. He continuously encouraged young people to attend college and earn a degree because “that piece of paper would open many doors for them.”<br><br>This scholarship was established in memory of John by his wife, Virginia, and his children, John S. Barrett, Jr. and Amy G. Barrett. It is the hope of John’s family that this scholarship will help open doors for its recipients.<br></p>"
  },
  {
    "slug": "johnston-family-scholarship",
    "name": "Johnston Family Scholarship",
    "eligibility": [
      "Must be a graduating high school senior",
      "Must be a resident of the Eastern Jackson or Lafayette County",
      "Must be pursuing an undergraduate degree in a healthcare specific field",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $2,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades through Fall Semester 2025"
    ],
    "description": "<p>This scholarship was established by Jill and Michael Johnston to provide scholarship support to students with financial need in the Eastern Jackson and Lafayette County areas who are dedicated to living lives of service to others through careers in the healthcare field.&nbsp;</p><p></p>"
  },
  {
    "slug": "josh-borgmeyer-memorial-scholarship",
    "name": "Josh Borgmeyer Memorial Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>The Josh Borgmeyer Memorial Scholarship is awarded as part of the Blue Springs High School Drama Booster Scholarship Program. The scholarship is awarded on the basis of attendance and participation in the Blue Springs High School Drama Club.</p><p>For more information, please contact Katie Okenquist <a href=\"mailto:KOkenquist@BSSD.NET\"></a><a href=\"mailto:KOkenquist@BSSD.NET\">KOkenquist@BSSD.NET</a> with the BSHS Drama Boosters Club. <br></p>"
  },
  {
    "slug": "jovial-scholarship",
    "name": "Jovial Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from any high school in Jackson County, MO;",
      "Must have demonstrated financial need;",
      "Must have demonstrated participation in extra-curricular activities such as sports, arts, clubs, or community service;",
      "Must have demonstrated perseverance and moral character;",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must be majoring in a healthcare-specific field;",
      "Must have had cancer or have had a member of immediate family member with cancer."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding if the student continues to meet the criteria for the scholarship. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Essay of approximately 500 words addressing how overcoming adversity has impacted your life. If you or your parent have had cancer, please address how that experience has impacted your life and your drive to overcome adversity.",
      "Letter of Recommendation from a teacher, coach, minister, mentor, or other influential adult in your life who can speak to your ability to overcome adversity."
    ],
    "description": "<p>Alicia Wolford was beloved by her husband Russell who chose to establish this scholarship in her memory after she passed away from ovarian cancer. Alicia graduated from Blue Springs High School and joined the Air Force Reserves following high school. She put herself through college and graduated with a degree in accounting. Alicia had a successful career in accounting and business because of her grit and determination.</p><p>Those characteristics also helped Alicia’s brave fight against ovarian cancer, during which she was able to continue working full-time until the week before her passing. During the last week of her life, Alicia used the word “jovial” in every conversation she had, and it was her final word. Russell believes Alicia’s extraordinary ability to see the beauty and possibilities in every situation, no matter how difficult, is how she should be remembered.</p><p>This scholarship was established to serve as an enduring memorial to Alicia’s life and to support students who have similar determination and positive attitude through adversity.</p><p></p>"
  },
  {
    "slug": "julie-elizabeth-marshall-memorial-scholarship",
    "name": "Julie Elizabeth Marshall Memorial Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Eligible applicants must be students enrolled at the Nativity of Mary School in Independence. This scholarship is in the amount of $500 for tuition assistance.</p><p>For more information, please contact the Nativity of Mary School at <a href=\"tel:8163530284\">(816) 353-0284</a>.</p>"
  },
  {
    "slug": "kansas-city-hospice-palliative-care-pamela-puppe-patient-care-scholarship",
    "name": "Kansas City Hospice & Palliative Care Pamela Puppe Patient Care Scholarship",
    "eligibility": [
      "Must be a full- or part-time employee of Kansas City Hospice & Palliative Care, having completed ninety (90) calendar days of full- or part-time employment at the time of application;",
      "Must be pursuing professional certification requirements; Continuing Education Units related to completing, renewing or maintaining professional certification; or college courses to enhance skills related to current or future patient care positions;",
      "Courses must be taken through an accredited junior college, college, or university;",
      "A minimum grade of \"B\" or equivalent must be attained for each course taken."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship may be renewed. A complete application must be submitted each year."
    },
    "deadline": "May 1.",
    "requirements": [],
    "description": "<p>The Kansas City Hospice &amp; Palliative Care Pamela Puppe Patient Care Scholarship was established in 2021 to benefit employees of Kansas City Hospice &amp; Palliative Care who are pursuing higher education to advance their knowledge and skills to care for Kansas City Hospice &amp; Palliative Care patients.</p><p>Mrs. Puppe dreamed as a child of being a nurse, but she did not have the resources or support to pursue her dream. It is her hope that this scholarship will provide the resources and support she wished she had to the employees of Kansas City Hospice &amp; Palliative Care. Mrs. Puppe established this scholarship to honor the difference Kansas City Hospice's caregivers have made in some of the most difficult times in her life.</p><p></p>"
  },
  {
    "slug": "kay-and-morris-dunning-nursing-scholarship",
    "name": "Kay and Morris Dunning Nursing Scholarship",
    "eligibility": [
      "Must be pursuing a bachelor’s degree in nursing at University of Central Missouri, Graceland University, Park University, MCC-Penn Valley, Rockhurst University or Research College of Nursing;",
      "Must have successfully completed at least 36 hours of courses;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated participation in extracurricular, community service, and/or work activities;",
      "Must have excellent communication skills;",
      "Must be a resident of metropolitan Kansas City;",
      "Financial need may be considered."
    ],
    "amount": "Up to $1,500 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of Recommendation",
      "Documentation of acceptance to a nursing program."
    ],
    "description": "<p>The Dunning family of Independence, Missouri, established this scholarship to commemorate Kay Dunning for her many years of service in healthcare. The scholarship is intended to benefit students pursuing bachelor’s degrees in nursing at area colleges and universities.</p><p></p>"
  },
  {
    "slug": "lafayette-county-c-1-education-foundation-scholarships",
    "name": "Lafayette County C-1 Education Foundation Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages Lafayette County C-1 School District Foundation’s scholarship funds. Eligible applicants must be graduating seniors from Lafayette County C-1 High School.<br><br>For more information, please contact the Lafayette County C-1 High School Counseling Center.</p>"
  },
  {
    "slug": "laura-g-stark-memorial-scholarship",
    "name": "Laura G. Stark Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Lee’s Summit High School or Lee’s Summit West High School in Lee’s Summit, Missouri;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must be pursuing an undergraduate degree in human healthcare at any accredited junior college, college or university including:Healthcare- Respiratory TherapyHealthcare- PsychologyHealthcare- NursingHealthcare- Human relatedHealthcare- PharmacyHealthcare- RadiologyHealthcare- Social WorkAllied Healthcare FieldHealthcare- Pre-MedHealthcare- OtherHealthcare- Medical DoctorHealthcare- Public HealthBiology- Pre-Med",
      "Healthcare- Respiratory Therapy",
      "Healthcare- Psychology",
      "Healthcare- Nursing",
      "Healthcare- Human related",
      "Healthcare- Pharmacy",
      "Healthcare- Radiology",
      "Healthcare- Social Work",
      "Allied Healthcare Field",
      "Healthcare- Pre-Med",
      "Healthcare- Other",
      "Healthcare- Medical Doctor",
      "Healthcare- Public Health",
      "Biology- Pre-Med",
      "Personal interviews may be required."
    ],
    "amount": "Up to $1,000.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal reference from a teacher or supervisor.",
      "Personal reference, if you choose, from a teacher, coach, or other influential adult in your life.",
      "List of other scholarships you have applied for including the amounts and whether you have been awarded the scholarship."
    ],
    "description": "<p>This scholarship was established in memory of Laura G. Stark by her family. Laura was a physically fit, fun loving and devoted single mother of two sons who unexpectedly died of acute respiratory distress syndrome. She was a sports mom who had a great zest for life and laughter. Laura valued the educational process and went to great lengths to prepare her children for their future.</p><p></p>"
  },
  {
    "slug": "lester-and-mary-homfeld-scholarship",
    "name": "Lester and Mary Homfeld Scholarship",
    "eligibility": [
      "Must be a graduating senior from Lexington High School or Lafayette County C-1 High School;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college or university, or technical certification at any accredited trade school, in Missouri or Kansas;",
      "Must have a 3.0 minimum GPA;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p>The Lester and Mary Homfeld Endowed Scholarship was established in 2019 to provide a college education for graduating high school seniors from Lexington and Lafayette County High Schools.</p><p></p>"
  },
  {
    "slug": "linda-landahl-edison-education-scholarship",
    "name": "Linda Landahl Edison Education Scholarship",
    "eligibility": [
      "Must be a graduating senior from Blue Springs High School;",
      "Must be pursuing an associate or bachelor’s degree in education at an accredited institution;",
      "Preference will be given to candidates who have demonstrated financial need;",
      "Preference given to students attending college in MO or surrounding states."
    ],
    "amount": "Up to $5,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "No, this is not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "General essay prompt: “Please upload a one-page essay about yourself and your educational and career goals.”",
      "Letter of Recommendation: “Please upload a letter of reference from a community leader/non-relative (teacher, pastor, employer, scout leader, etc.).”"
    ],
    "description": "<p>Mrs. Linda Landahl Edison taught for 39 years in the Blue Springs School District including both the elementary and high school levels, educating thousands of students. She was named the district Teacher of the Month and an Outstanding Teacher of Lucy Franklin School for her dedication. Linda also served as vice president for the Blue Springs Community Educators Association, was a member of the Missouri State Teachers Association, and was part of the Missouri Retired Teachers Association.</p><p>Linda’s service to the Blue Springs community included more than 20 years as a member of the Park Commission and serving as its chair for many years. Her actional helped shape the Parks and Recreation Department, including city bond issues and the Vesper Hall accreditation and re-accreditation processes. She was a member of the city’s strategic visioning sessions outlining plans for the growth of Blue Springs.</p><p>Linda believes that education is the key to life and established this scholarship to benefit students from Blue Springs High School who are pursuing careers in education.</p><p></p>"
  },
  {
    "slug": "lutz-family-scholarship",
    "name": "Lutz Family Scholarship",
    "eligibility": [
      "Must be a graduating senior from Butler High School, Butler, MO.;",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must be pursuing a certificate or degree at any accredited technical or vocational school, junior college, college, or university."
    ],
    "amount": "Up to $5,000 per academic year.Renewable:May be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Up to $5,000 per academic year.Renewable:May be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Essay explaining why you are the best candidate to receive this award (500 words maximum);",
      "Essay sharing your short- and long-term goals (500 words maximum).",
      "Essay sharing what the Butler School District has meant to you and how has it influenced you (500 words maximum).",
      "Submit a letter of recommendation from someone in the community (NOT someone associated with the Butler School System)."
    ],
    "description": "<p>The Lutz Family Scholarship was established to benefit students graduating from the Butler R-5 school system and electing to continue their education. The Lutz family grew up in Butler, where both daughters graduated, the wife taught English for many years, and the father was on the school board for nine years. The Lutz family’s wish is to give back or pay it forward to the Butler School District in return for all the opportunity provided to them.</p><p></p>"
  },
  {
    "slug": "mark-stanke-memorial-scholarship",
    "name": "Mark Stanke Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Truman or Lee’s Summit West High School;",
      "Must be seeking a bachelor’s degree at any accredited college or university;",
      "Must have demonstrated strong work ethic and high ethical standards;",
      "Must have demonstrated acceptance, kindness, and respect beyond their family and friend group;",
      "Must have demonstrated determination and perseverance to overcome challenges;",
      "Must have demonstrated outstanding achievement in school activities such as sports, clubs, or out-of-school activities such as work and community service;",
      "Must have cumulative GPA of 3.0."
    ],
    "amount": "Up to $2,500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Submit an essay of approximately 500 words describing yourself and how you meet the following:An ethic of hard work balanced with a zeal for life;Perseverance to overcome adversity or challenges;Reflect on “Chief Tecumseh Death Song”: “Love your life, perfect your life, beautify all things in your life. Seek to make your life long and its purpose in the service of your people.”",
      "An ethic of hard work balanced with a zeal for life;",
      "Perseverance to overcome adversity or challenges;",
      "Reflect on “Chief Tecumseh Death Song”: “Love your life, perfect your life, beautify all things in your life. Seek to make your life long and its purpose in the service of your people.”",
      "One personal reference letter from a school or community leader describing how you meet the scholarship requirements."
    ],
    "description": "<p>“Love your life, perfect your life, beautify all things in your life. Seek to make your life long and its purpose in the service of your people.” Chief Tecumseh</p><p>Mark Stanke was an exceptional human. As a young adult, he was an accomplished volleyball and football student athlete at Truman High School in Independence, MO and at Graceland University in Lamoni, IA. Post-graduation, Mark worked for Chrysler Corporation for many years and rose in leadership ranks before his entrepreneurial spirit pushed him to launch his own business. Mark and his wife, Elizabeth, worked together to grow that business while making their home in Lee’s Summit, MO, and raising their two children, both graduates of Lee’s Summit West.</p><p>Mark valued advanced education and hard work earning his MBA. He was a respected, caring leader at work and in his community. Despite this strong work ethic, he always prioritized his family and extended family and certainly knew how to enjoy life to its fullest. He had a deep passion for sports (his kids’ sports, college sports, the KC hometown teams), the outdoors, traveling to Maine and Hawaii to visit family, and of course Kansas City barbeque!</p><p>Mark was beloved by many for his fierce optimism, humor, kindness, insight, and mental and physical toughness. He was a friend to everyone, and he went out of his way to make others feel cared for regardless of position or background. He passed away in 2014 after a courageous battle with gastrointestinal stromal tumor (GIST), a rare form of cancer. Upon his passing, his wife Elizabeth found a poignant poem by Chief Tecumseh (above) that Mark had saved in his daily journal on his phone. Those words truly exemplified how Mark lived and died.</p><p>Mark was exceptional in the eyes of many, but his family believe he would suggest that everyone is worthy of and should aspire to live an exceptional life in the precious time they are granted.</p><p>To honor and pass on Mark’s legacy, the Mark Stanke Memorial Scholarship Fund was established by Mark’s family and friends to benefit students in Eastern Jackson County, Missouri who are graduating from Truman High School or Lee’s Summit West High School and who plan to pursue a degree at a four-year college or university. We wish the spirit of Mark, and the ripples he created in 52 years, may inspire future generations to live an impactful life full of gratitude, service, and love.</p><p></p>"
  },
  {
    "slug": "mary-mimi-lynch-scholarship",
    "name": "Mary (Mimi) Lynch Scholarship",
    "eligibility": [
      "Must be enrolled at St. Michael the Archangel High School in Lee's Summit;",
      "Must have attended St. Regis Academy in Kansas City;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $1,500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Mary (Mimi) Lynch was a beloved wife, mother, and Mimi. Her family established this scholarship to honor her memory and legacy of giving to others.</p><p></p>"
  },
  {
    "slug": "mary-k-axtell-trust-scholarship",
    "name": "Mary K. Axtell Trust Scholarship",
    "eligibility": [
      "Must be a resident of Carroll County or Ray County;",
      "Must be a graduating senior or past graduate from a public high school serving residents of Carroll County or Ray County;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college or university or certification from an accredited technical school. Preference may be given to those pursuing agriculture related degrees."
    ],
    "amount": "Up to $5,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from at least one supervisor of an activity included in the resume you previously submitted.",
      "Up to two more references may be submitted, if you choose."
    ],
    "description": "<p>The Mary K. Axtell Trust Scholarship was established in 2019 to provide college education for worthy young men and women of Carroll County and Ray County.<br><br>Mary Katherine (Bush) Axtell was the daughter of Saline County cattleman and farmer Pike Caleb Bush and Pauline Metod Jones Bush. Early settlers in Missouri, the Bush family had a large stock ranch and farms in Carroll County near Norborne, Missouri, a Wood Heights farm in Ray County and a ranch in Jeff Davis County, Texas near Valentine. Mary, the second of three children, inherited parcels of the family farms when her parents passed away.<br><br>Mary passed away in 1960, and her trust was eventually administrated by Blue Ridge Bank and Trust Co. (BRBT), which petitioned the court to modify the trust so that the real estate could be sold. When the Bush family farms were sold, BRBT organized a scholarship fund in conjunction with Truman Heartland Community Foundation. As instructed in Mary’s charitable will and testamentary trust, the scholarship will provide perpetual support for students of Ray and Carroll County.<br><br>The Mary K. Axtell Trust Scholarship provides up to $5,000 per academic year for graduating high school seniors or past graduates from public high schools serving residents of Carroll County or Ray County and can be renewed for up to three additional years. Applicants must be pursuing an undergraduate degree at an accredited junior college, college or university or a certification from an accredited technical school. Preference may be given to students pursuing agriculture related degrees.</p><p></p>"
  },
  {
    "slug": "mcmillin-family-foundation-scholarship",
    "name": "McMillin Family Foundation Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from the Fort Osage School District;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college, or university;",
      "Must have a demonstrated participation in school activities;",
      "Must be in the top 25% of graduating class."
    ],
    "amount": "Up to $1,000 per academic year. Renewable: Yes, this scholarship can be renewed for three additional years of funding to complete and undergraduate degree. If the candidate pursues a graduate degree upon completion of their undergraduate degree, two further years of additional funding my be awarded. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000 per academic year. Renewable: Yes, this scholarship can be renewed for three additional years of funding to complete and undergraduate degree. If the candidate pursues a graduate degree upon completion of their undergraduate degree, two further years of additional funding my be awarded. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "At least one personal reference letter from a supervisor of a school activity in which you participated or a teacher. You may attach a second reference, if you choose."
    ],
    "description": "<p>Betty Jean McMillin was a teacher and world traveler who loved to visit other cultures. She was often touched by the impoverishment of people due to the lack of opportunity. Betty established the McMillin Family Foundation Scholarship to help others attain the skills needed for a good future and to honor her parents, Clarence and Lucile, and her brother, Edward.<br><br>The McMillin family has been in the area for several generations. Clarence was a farmer in the early years of his life. Later he became a steel worker at Armco until he retired. He was a hard worker and was remembered for his great gardens. Lucile was from the Brooks family, who were early homesteaders in South Dakota. Lucile remembered riding in a horse-drawn wagon across the prairies of Nebraska. She was a kind and gentle soul who took great care of her family with very little means. Betty had one younger brother, Edward, who was a carpenter. He worked very hard for everything he earned and was a great role model for his family.<br><br>Betty recognized the importance of a good education and built her life around helping others prepare for their futures. She received her bachelor’s degree in teaching from Central Missouri State in Warrensburg, later receiving a master’s degree in commerce from the University of Wyoming. She spent her career teaching at Northeast High School in Kansas City, Missouri. Betty knew how important her family’s support was when she was in school, so her dream was to establish a scholarship fund to help others meet the expenses of a college education.<br></p>"
  },
  {
    "slug": "medical-alliance-of-the-metropolitan-medical-society-of-greater-kansas-city-scholarship",
    "name": "Medical Alliance of the Metropolitan Medical Society of Greater Kansas City Scholarship",
    "eligibility": [
      "Must be at least a sophomore pursuing an undergraduate degree in nursing or an allied healthcare field at an accredited college or university;",
      "Must have completed all prerequisite courses and have been admitted into a specific nursing or allied healthcare-related degree program;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated participation in extracurricular activities, community service, and/or work;",
      "Must have excellent communication skills;",
      "Must be a resident of metropolitan Kansas City;",
      "Financial need may be considered."
    ],
    "amount": "Up $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal essay of 500 words stating what medicine means to you and how you hope to use your profession to help others.",
      "Personal recommendation from someone who can attest to your professional abilities.",
      "Acceptance letter from nursing or allied healthcare-related degree program."
    ],
    "description": "<p>The Medical Alliance of the Metropolitan Medical Society of Greater Kansas City established this scholarship to benefit students pursuing undergraduate degrees in nursing or other allied health careers such as occupational therapy, physical therapy, medical assisting, anesthesiology, etc.</p><p></p>"
  },
  {
    "slug": "midwest-hemophilia-association-georgia-northway-scholarship",
    "name": "Midwest Hemophilia Association Georgia Northway Scholarship",
    "eligibility": [
      "Must be a member or relative (if under 21) of member in good standing with the Midwest Hemophilia Association"
    ],
    "amount": "May be $3,000 - $5,000 depending on funding.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of reference from a supervisor of an activity in the resume you submit in your application;",
      "Letter from doctor certifying that you either have hemophilia or a related bleeding disorder or are the family member/carrier for hemophilia or related bleeding disorder;"
    ],
    "description": "<p>The Midwest Hemophilia Association offers this scholarship for students who have been diagnosed or have a family member diagnosed with a bleeding disorder. Eligible applicants must be members or relatives (if under 21) of members in good standing with the Midwest Hemophilia Association.</p><p></p>"
  },
  {
    "slug": "norman-and-linda-humphrey-scholarship",
    "name": "Norman and Linda Humphrey Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from the Independence School District;",
      "Must be pursuing an undergraduate degree or certification program at any technical institution, junior college, college or university;",
      "Must have participation in non-athletic competitive activities (e.g. Debate, Scholar Bowl, musical performance);",
      "Must have demonstrated financial need;",
      "Must have demonstrated Intellectual curiosity and broad academic interests;",
      "Must have demonstrated community service participation."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a supervisor of an activity included in the resume submitted as part of the application."
    ],
    "description": "<p>Norman Humphrey was a beloved husband, father, grandfather, and great grandfather. He was also an active member of the Independence community. In addition to being a founding partner of the law firm of Humphry, Farrington and McClain, Norm held leadership positions in the Independence Host Lions Club, Independence Rotary Club, Eastern Jackson County Bar Association, Independence YMCA, Independence Board of Education, and Independence Regional Hospital Board. Education was very important to Norm, and he volunteered as a reading mentor at Proctor Elementary School. This scholarship was established by his family and friends to honor his memory and benefit graduates of the Independence School District.</p><p></p>"
  },
  {
    "slug": "norman-and-mary-anne-davidson-scholarship",
    "name": "Norman and Mary Anne Davidson Scholarship",
    "eligibility": [
      "Must be a resident of Independence, MO;",
      "Must be pursuing undergraduate or graduate degrees or certification programs with college credit;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated financial need;",
      "Must have demonstrated participation in work, caregiving responsibilities, school activities, and/or community service;",
      "Must have demonstrated leadership capabilities."
    ],
    "amount": "Up to $8,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship is renewable for up to four additional years. An annual renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of reference."
    ],
    "description": "<p></p>"
  },
  {
    "slug": "oak-grove-school-district-education-foundation-scholarships",
    "name": "Oak Grove School District Education Foundation Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages Oak Grove School District Foundation’s scholarship funds. Eligible applicants must be graduating seniors from Oak Grove High School.<br><br>For more information, please contact the Oak Grove High School Counseling Center.</p>"
  },
  {
    "slug": "opal-barker-day-and-phyllis-day-combest-scholarship",
    "name": "Opal Barker Day and Phyllis Day Combest Scholarship",
    "eligibility": [
      "Must have been a resident of Eastern Jackson County for the past 12 months or a high school graduate of any public or private high school in the Blue Springs, Fort Osage, Grain Valley, Independence, Lee’s Summit, Lone Jack, Oak Grove, Raytown, Odessa or Lafayette County school districts;",
      "Must be currently enrolled as a full time student in a minimum of 12 credit hours of classes at UCM;",
      "Must have successfully completed a minimum of 24 credit hours at the time of application;",
      "Must be a pursuing a bachelor's degree in elementary education or early childhood education at the University of Central Missouri."
    ],
    "amount": "Up to $10,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment at UCM and a minimum college cumulative GPA of 3.2."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p>The Opal Barker Day and Phyllis Day Combest scholarship was established to support residents of Eastern Jackson County pursuing undergraduate degrees in elementary education at the University of Central Missouri.</p><p></p>"
  },
  {
    "slug": "pat-barnhard-memorial-scholarship",
    "name": "Pat Barnhard Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from Truman, Van Horn, William Chrisman, or Fort Osage High School in Independence, Missouri;",
      "Must plan to pursue a degree in history, political science or business at an accredited junior college, college or university;",
      "Must have demonstrated two year participation in history, political science or business extra-curricular activities (school related or other);",
      "Must have demonstrated two year participation in community service activities;",
      "Must have a minimum GPA of 3.0."
    ],
    "amount": "Up to $500.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "One or two letters of reference from supervisors or teachers."
    ],
    "description": "<p>Steven Patrick “Pat” Barnhard graduated from William Chrisman High School in 1985. He went on to earn a B.A. in broadcasting with a minor in political science and an M.A. in history from Northwest Missouri State University. His love of history and political science led him to serve as an intern for Congressman Ike Skelton in 1991, through the Lyndon B. Johnson Congressional Internship program.</p><p>Pat’s compassion for those less fortunate led him to serve many times as the director of Camp Opportunity for abused and neglected children and as a YouthFriends mentor later in his life. His community involvement was substantial as well. He volunteered his time in leadership positions with the Independence Chamber of Commerce, American Foundry Society and the Kansas City Scottish Rite.</p><p>Pat was a successful businessman with Edward Jones Investments, helping individuals help themselves by guiding them toward financial security. He conducted his business and community dealings from the foundation of strong faith and served as a priesthood member of the Community of Christ and youth leader in his church congregation. His love of people and dedication to his family and friends were exemplary.</p><p>He is survived by his wife, Sonia, his children Mia and Noah and his parents, Dwight and Carolyn Barnhard. His family and friends established this scholarship as a tribute to the life of service that Pat led. The scholarship will support college education for graduating seniors from William Chrisman High School who plan to study history, political science or business and have a heart for community service.</p><p></p>"
  },
  {
    "slug": "phillip-zaroor-entrepreneurial-scholarship",
    "name": "Phillip Zaroor Entrepreneurial Scholarship",
    "eligibility": [
      "Must be graduating senior from Harrisonville High School;",
      "Must be pursuing an undergraduate degree at any accredited two or four year college, university or trade school;",
      "Must have demonstrated entrepreneurial spirit;",
      "Must have minimum cumulative high school GPA of 3.25;",
      "Must have demonstrated involvement in school and/or community related activities."
    ],
    "amount": "$250 – $1,000 per academic year. (Year 1, $250 | Year 2, $500 | Year 3, $750 | Year 4, $1,000)Renewable:",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:$250 – $1,000 per academic year. (Year 1, $250 | Year 2, $500 | Year 3, $750 | Year 4, $1,000)Renewable:"
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>“You can’t be extraordinary doing ordinary things.” This was a phrase that Phillip Zaroor lived by and used to inspire those around him to strive for excellence. Alongside his wife and partner, Rhita Zaroor, Phil built an extraordinary legacy through his family, charitable work and numerous business ventures. Phil worked to pioneer the industry of tire performance management solutions through his business, Advantage PressurePro (now PressurePro Inc.), headquartered in Harrisonville, MO.&nbsp;<br><br>Phil’s work at PressurePro was influential around the world, making the roads safer and creating savings and efficiencies for drivers and fleets of all types and sizes. During his career, Phillip was recognized as one of the country’s top entrepreneurs in Fortune Small Business Magazine, was honored by author David Thomson in his book, “Blueprint to a Billion: 7 Essentials to Achieve Exponential Growth,” and was awarded numerous honors in the Kansas City community and beyond.<br><br>Perhaps more importantly to Phil, he was a pillar in his community. His commitment to his family and business was matched only by his drive to help others. A founder of Harrisonville’s Rotary Club, a 17-year youth football coach, and a staple in the local business community and the transportation industry worldwide, Phil was regarded as a mentor and friend by countless people.&nbsp;<br><br>The Zaroor family established the Phillip Zaroor Entrepreneurial Scholarship to honor Phillip’s legacy by providing support for graduates of Harrisonville High School who are passionate about entrepreneurship.&nbsp;<br><br><strong>Eligibility</strong>:</p><ul><li>Must be graduating senior from Harrisonville High School;</li><li>Must be pursuing an undergraduate degree at any accredited two or four year college, university or trade school;</li><li>Must have demonstrated entrepreneurial spirit;</li><li>Must have minimum cumulative high school GPA of 3.25;</li><li>Must have demonstrated involvement in school and/or community related activities.</li></ul><p><strong>Amount:</strong><br>$250 – $1,000 per academic year. (Year 1, $250 | Year 2, $500 | Year 3, $750 | Year 4, $1,000)<br><br><strong>Renewable:</strong></p><p>Yes, this scholarship can be renewed for up to three additional years of funding. Renew by submitting a Zaroor application in the application portal.<br><br><strong>Deadlines:</strong></p><p>Applications must be submitted by <strong>April 16.</strong></p><p><strong>Apply:</strong></p><p><a href=\"https://www.thcf.org/students/scholarships/apply-now\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Click HERE to apply!</strong></a></p>"
  },
  {
    "slug": "rachel-house-hudson-memorial-scholarship",
    "name": "Rachel House Hudson Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior from a public or private high school in Blue Springs, Fort Osage, Grain Valley, Independence, Lee’s Summit, Oak Grove or Raytown school districts;",
      "Must have demonstrated faithfulness to God and a desire to grow in that relationship;",
      "Must have demonstrated high moral standards;",
      "Must have demonstrated trustworthiness in their relationships with others, treating them with kindness and respect;",
      "Must have demonstrated determination and perseverance;",
      "Must have demonstrated participation in school activities such as sports as well as out-of-school activities such as work and community service.",
      "Must have a minimum cumulative GPA of 3.0."
    ],
    "amount": "Up to $1,000.Renewable:Not a renewable scholarship.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000.Renewable:Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "An essay (250-500 words) describing yourself and how you meet the following: a) Faithfulness to God and a desire to grow in that relationship; b) a life of high moral standards; c) trustworthy in relationships with others, treating them with kindness and respect; d) demonstrate a life filled with determination and perseverance.",
      "At least one personal reference letter from a pastor describing how you meet the scholarship requirements.",
      "Optional reference letter from a teacher or administrator, describing how you meet the scholarship requirements."
    ],
    "description": "<p>Harvey and Lois House’s oldest child, Rachel, was a bright star. Growing up in Grain Valley, she was an outstanding student and a member of the National Honor Society. In addition to her academics, Rachel was active in everything from band and choir to cheerleading and track.<br><br>Rachel left home to attend college at Northwest Missouri State University, where she remained active in cheerleading as a varsity cheerleader. Rachel graduated Magna Cum Laude with a degree in Corporate Fitness. After college, Rachel landed her dream job as a personal trainer with a major Kansas City business and married her college sweetheart. One month after her wedding, while driving home from work, Rachel was tragically killed in a car accident. She was 21 years old.<br><br>Through their heartbreak, Harvey and Lois have continued to find solace in the knowledge that Rachel is in heaven. During her short life, Rachel gave Harvey and Lois many things about which to be proud. But they are most proud of Rachel’s positive moral character influenced by her strong Christian faith. In the years since Rachel passed away, Harvey and Lois have poured the grief of her loss into honoring and remembering Rachel’s character. This scholarship will support graduating seniors from Eastern Jackson County with strong faith and moral character similar to Rachel’s.<br></p>"
  },
  {
    "slug": "raytown-educational-foundation-scholarships",
    "name": "Raytown Educational Foundation Scholarships",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages Raytown Educational Foundation Scholarships. Eligible applicants must be graduating seniors of Raytown high schools.<br><br>For more information, please contact <a href=\"mailto:ref@raytownschools.org?subject=scholarships\">Martha Cockerell</a> or visit <a href=\"http://www.raytowneducationalfoundation.org/\" target=\"_blank\" rel=\"noreferrer noopener\">www.raytowneducationalfoundation.org.</a></p>"
  },
  {
    "slug": "rolfe-bridge-scholarship",
    "name": "Rolfe Bridge Scholarship",
    "eligibility": [
      "Must be a graduating high school senior;",
      "Must be a graduate of a bridge course taught by Kathy Rolfe or a by a student of a Kathy Rolfe bridge course;",
      "Must be a member of the American Contract Bridge League;",
      "Must have a demonstrated interest in contract bridge and have earned a minimum of one masterpoint;",
      "Must have a minimum cumulative GPA of 3.0."
    ],
    "amount": "Up to $500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Renewable for up to four years of total funding. Renew by completing the Rolfe Bridge application in the portal."
    },
    "deadline": "Applications must be submitted by July 31.",
    "requirements": [],
    "description": "<p>As a lifelong bridge player, Kathy Rolfe has always tried to promote the game of bridge. She has taught many friends and relatives over the years. In 2002, she began teaching students in Lee’s Summit, Missouri, within the local schools as an accredited American Contract Bridge League teacher. This scholarship is designed to provide motivation for Kathy’s students to continue to play and learn more about this game which will provide lifelong opportunities for enjoyment, learning and social contacts.</p><p></p>"
  },
  {
    "slug": "ron-bruch-nursing-scholarship",
    "name": "Ron Bruch Nursing Scholarship",
    "eligibility": [
      "Must be a resident of the metropolitan Kansas City area;",
      "Must be pursuing a baccalaureate degree in nursing at Graceland University;",
      "Must have completed the sophomore level courses;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated participation in extracurricular, community service, and/or work activities;",
      "Must have excellent communication skills;",
      "Financial need may be considered."
    ],
    "amount": "Up to $750 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p></p>"
  },
  {
    "slug": "rotary-club-of-eastern-independence-scholarship",
    "name": "Rotary Club of Eastern Independence Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>The Rotary Club of Eastern Independence offers this scholarship for graduating seniors in the Fort Osage and Independence School Districts pursuing undergraduate degrees. Awards will be made to students with academic excellence and involvement with community service activities with preference given to students with financial need.</p><p>To apply, please contact the counseling center at Fort Osage or any Independence School District High School. </p>"
  },
  {
    "slug": "sam-and-lindsey-porter-scholarship",
    "name": "Sam and Lindsey Porter Scholarship",
    "eligibility": [
      "Must be a graduating senior from Truman, Van Horn, or William Chrisman High School, in Independence, Missouri;",
      "Must be pursuing an undergraduate degree at an accredited junior college, college or university;",
      "Must have demonstrated participation in extra-curricular school activities;",
      "Must have demonstrated participation in community service and work activities;",
      "Must have demonstrated financial need;",
      "Must have a minimum cumulative GPA of 3.0."
    ],
    "amount": "Up to $1,000.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal recommendation from a teacher, coach, or other influential adult in your life."
    ],
    "description": "<p>Lindsey and Sam Porter loved people. They were very friendly and outgoing students at Fairmount Elementary in Independence, Missouri. They enjoyed playing outside and both played soccer and basketball. Lindsey was eight and Sam was seven in 2004 when they died tragically.</p><p>Their mother, Tina Porter, and citizens and organizations in Independence raised several thousand dollars to establish a memorial fund at THCF. An initial grant from the memorial fund was made to build a playground in Independence in memory of Sam and Lindsey. The balance was used to create this scholarship in their names. The first award from the Sam and Lindsey Porter Scholarship was given in 2014, the year Lindsey would have graduated William Chrisman High School.</p><p></p>"
  },
  {
    "slug": "sara-garrett-memorial-scholarship",
    "name": "Sara Garrett Memorial Scholarship",
    "eligibility": [
      "Must be a graduating senior female varsity basketball player from Blue Springs High School in Blue Springs, Missouri;",
      "Must be pursuing an undergraduate degree at an accredited junior college, college, or university;",
      "Must have a cumulative minimum GPA of 3.0;",
      "Must have demonstrated participation in activities in school and the community;",
      "Must have personal qualities of being a caring, compassionate person who supports and helps others; a leader with a commitment to excellence; and someone who expresses determination and perseverance."
    ],
    "amount": "Up to $1,000.Renewable:Not a renewable scholarship.Deadlines:The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000.Renewable:Not a renewable scholarship.Deadlines:The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below)."
    },
    "deadline": "",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A brief summary of your basketball history from when you began playing basketball to the present (e.g. recreation leagues, AAU, School teams, etc.) and describing what basketball means to you.",
      "A personal reference from someone unrelated to basketball activities."
    ],
    "description": "<p>Sara Garrett, who lost her life in an automobile accident, was a caring and compassionate person. She received both academic and athletic scholarships, played collegiate basketball in national tournaments and received her degree with honors. This scholarship has been established in Sara’s name to honor her memory.<br></p>"
  },
  {
    "slug": "seger-family-nursing-scholarship",
    "name": "Seger Family Nursing Scholarship",
    "eligibility": [
      "Must be a resident of the metropolitan Kansas City area;",
      "Must be pursuing a baccalaureate degree in nursing at Graceland University;",
      "Must have completed the sophomore level courses;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated participation in extracurricular, community service, and/or work activities;",
      "Must have excellent communication skills;",
      "Financial need may be considered."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Letter of recommendation"
    ],
    "description": "<p>The Seger Family of Lee’s Summit, Missouri, established this scholarship to benefit students pursuing baccalaureate degrees in nursing at Graceland University.</p><p></p>"
  },
  {
    "slug": "senator-ronnie-depasco-police-academy-scholarship",
    "name": "Senator Ronnie DePasco Police Academy Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Senator Ronnie DePasco was a resident of the Historic Northeast neighborhood in Kansas City, Missouri, for over 50 years. In 1976, with encouragement from family and friends, DePasco ran for the Missouri House of Representatives. Winning that election, he went on to represent the Northeast area in the House for the next 16 years. In 1992, he was elected to the Missouri Senate. He was reelected to this position several more times and proudly served as Senator until his death in 2003.</p><p>During DePasco’s tenure as an elected official, he achieved many notable goals, including securing funding for the Liberty Memorial, the Harry S. Truman Library &amp; Museum, the Truman Memorial Building and the historic Harry S. Truman Courthouse in Independence. As an avid supporter of law enforcement, he was widely recognized for his work on issues affecting the Kansas City, Missouri, Police Department and his sponsorship of many anti-crime bills such as Jake’s Law.</p><p>Senator DePasco’s family has established this scholarship foundation to honor his memory and the love he had for his community and its future.</p>"
  },
  {
    "slug": "senator-ronnie-depasco-scholarship",
    "name": "Senator Ronnie DePasco Scholarship",
    "eligibility": [
      "Must be a graduating senior from a public high school from the Kansas City metro area;",
      "Must be the dependent of an employee of the Kansas City, Missouri Police Department;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college or university in Missouri;",
      "Must have demonstrated participation in school activities and community service."
    ],
    "amount": "Up to $2,500 per academic year.Renewable:May be renewed for three additional years of funding if applicant continues to meet the above eligibility criteria. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $2,500 per academic year.Renewable:May be renewed for three additional years of funding if applicant continues to meet the above eligibility criteria. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "An essay of approximately 500 words that elaborates on your educational and career goals and describes and event or situation, whether positive or negative, that has impacted your life;",
      "A letter of reference from a teacher, pastor, or other influential adult in your life."
    ],
    "description": "<p>Senator Ronnie DePasco was a resident of the Historic Northeast neighborhood in Kansas City, Missouri, for over 50 years. He attended Holy Trinity grade school and graduated from Northeast High School in 1962.<br><br>After attending Maple Woods Community College, DePasco went to work for Armco Steel, working in the metallurgical department for 5 years. He left Armco to run the family business, DePasco’s Tavern, which was established in 1934, and was located at 12th and Cleveland.<br><br>In 1976, with encouragement from family and friends, DePasco ran for the Missouri House of Representatives. Winning that election, he went on to represent the Northeast area in the House for the next 16 years. In 1992, he was elected to the Missouri Senate. He was reelected to this position several more times and proudly served as Senator until his death in 2003.<br><br>During DePasco’s tenure as an elected official, he achieved many notable goals, including securing funding for the Liberty Memorial, the Harry S. Truman Library &amp; Museum, the Truman Memorial Building and the historic Harry S. Truman Courthouse in Independence.<br><br>As an avid supporter of law enforcement, he was widely recognized for his work on issues affecting the Kansas City, Missouri, Police Department and his sponsorship of many anti-crime bills such as Jake’s Law. His proudest political achievement was the creation of the Cliff Drive Scenic Byway. It was officially named the Ronnie DePasco Scenic Byway in 2003, with plaques at each of the four entrances honoring him.<br><br>While Ronnie was always modest about his accomplishments, others profusely praised and honored them. Over 40 organizations honored him as “Senator of the Year” or “Man of the Year.” The Kansas City Star reported that DePasco “was remembered as a man of wit and compassion whose affection for the old neighborhood in the Northeast area of Kansas City endured for a lifetime.”<br><br>Understanding this devotion, his family has established this scholarship foundation to honor Senator DePasco and the love he had for his community and its future.<br></p>"
  },
  {
    "slug": "sixth-bomb-group-memorial-scholarship",
    "name": "Sixth Bomb Group Memorial Scholarship",
    "eligibility": [
      "Must be relative of a member of the Sixth Bomb Group;",
      "Must be pursuing an undergraduate degree at an accredited college or university (vocational and trade schools subject to review);",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must have demonstrated participation in extracurricular activities, community service and work;",
      "Financial need may be considered."
    ],
    "amount": "Up to $500.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $500.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Statement showing how you are related to a member of the Sixth Bomb group. Include name of Sixth Bomb group member, your relationship to him, etc."
    ],
    "description": "<p>This scholarship was established by the Sixth Bomb Group as a permanent memorial to the exploits, dedication, commitment and memories of the members of the Sixth Bomb Group while stationed on the island of Tinian in the Marianas Island during World War II (1944-1945). This scholarship is only available for relatives of members of the Sixth Bomb Group.<br></p>"
  },
  {
    "slug": "stella-moran-memorial-scholarship",
    "name": "Stella Moran Memorial Scholarship",
    "eligibility": [
      "Must be pursing an undergraduate degree in primary or secondary education at Baker University or Central Methodist University;",
      "Must have a minimum of 60 credit hours at time of application."
    ],
    "amount": "May be $500 – $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for up to two additional year of funding. An application must be submitted annually with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A short essay on how you believe becoming an educator will enable you to give back to your community.",
      "A short essay on how your involvement in the extracurricular, community service, and work activities in which you choose to participate has influenced your decision to be come an educator.",
      "A letter of reference is needed from a teacher, coach, pastor or mentor (influential adult)."
    ],
    "description": "<p>The family of Stella Moran established this scholarship as a permanent legacy to Stella. Education was always important to Stella, and she greatly admired those who dedicated their lives to teaching. This scholarship supports undergraduate education majors at Baker University or Central Methodist University.</p><p></p>"
  },
  {
    "slug": "steven-d-brown-scholarship",
    "name": "Steven D. Brown Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Steven D. Brown started teaching at Olathe High School in 1972. He served as assistant principal at Santa Fe Trail Junior High from 1974 to 1982. Mr. Brown became principal at Santa Fe Trail in 1982, and remained in that position until his untimely death on May 21, 1992.</p><p>Mr. Brown loved sports. He played basketball in college, coached at Olathe North and was an avid golfer. He was a member of the Olathe Christian Church and was active in community service, serving as chair of the Gardner Planning Commission for 10 years and as president of the Gardner Lions’ Club.<br></p><p>This memorial scholarship was established by Jeanne Brown Geiger in Steve’s honor to benefit students of the Olathe School District. </p><p>Applications are due the Friday after Spring Break. For more information, please contact the counseling office at your Olathe School District high school. </p>"
  },
  {
    "slug": "sugar-creek-business-and-civic-club-scholarship",
    "name": "Sugar Creek Business and Civic Club Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages the Sugar Creek Business and Civic Club Scholarship. Eligible applicants must have been residents of Sugar Creek for at least two years.</p><p>For more information, contact <a href=\"mailto:sjuldavis@aol.com?subject=Sugar%20Creek%20Civis%20scholarship\">Susan Davis</a> or <a href=\"mailto:ja_mcev@msn.com?subject=Sugar%20Creek%20Civic%20scholarship\">John McEvoy</a>.</p>"
  },
  {
    "slug": "sugar-creek-norman-and-mary-anne-davidson-scholarship",
    "name": "Sugar Creek Norman and Mary Anne Davidson Scholarship",
    "eligibility": [
      "Must be a graduating high school senior currently residing in Sugar Creek, MO for at least one year;",
      "Must have a minimum cumulative GPA of 2.5;",
      "Must be pursuing a certification or degree at any accredited junior college, college, or university."
    ],
    "amount": "Up to $1,500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A letter of reference from a community member (non-family)."
    ],
    "description": "<p>This scholarship was established through the bequest of Norman and Mary Anne Davidson to benefit graduating seniors from the city of Sugar Creek, MO.</p><p></p>"
  },
  {
    "slug": "therese-stegner-piper-memorial-scholarship",
    "name": "Therese Stegner (Piper) Memorial Scholarship",
    "eligibility": [
      "Must be a graduating high school senior from Belton High School;",
      "Must be pursuing an undergraduate degree in social work or any medical field at any accredited junior college, college, or university;",
      "Preference may be given to students with demonstrated financial need."
    ],
    "amount": "Up to $1,500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A reference letter from a supervisor of an activity included in the resume submitted as part of the application."
    ],
    "description": "<p>The Therese Stegner (Piper) Memorial Scholarship was established in 2022 to honor the memory of Therese Stegner (Piper). Therese's life was centered on helping the people around her. Therese spent her career as a social worker, where she constantly went above and beyond for all her clients. Therese also spent her time helping within her church, community, and family. Therese was a selfless, genuine, and compassionate woman. Therese's family is very excited to continue her legacy by awarding this \"helping hand\" scholarship in her memory.</p><p></p>"
  },
  {
    "slug": "thomas-c-locke-scholarship",
    "name": "Thomas C. Locke Scholarship",
    "eligibility": [
      "Must be a graduating seniors from any public high school in Eastern Jackson County, Missouri, including Independence, Blue Springs, Lee’s Summit, Raytown, Fort Osage, Grain Valley, and Oak Grove;",
      "Must be pursuing a undergraduate degree at any accredited junior college, college or university;",
      "Must have demonstrated participation in school activities such as sports, music or debate;",
      "Must have demonstrated participation in out-of-school activities such as work or community service;",
      "Must have career and personal goals related to those of Thomas Locke."
    ],
    "amount": "Up to $1,000.Renewable:Not a renewable scholarship.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $1,000.Renewable:Not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A typed essay with a maximum of 500 words on how your personal qualities, goals for the future, and life mirror those of Thomas C. Locke and his achievements.",
      "At least one personal reference letter from a teacher, coach, or other influential adult in your life. You may include up to two more personal reference letters from one of the same sources."
    ],
    "description": "<p>The Eastern Jackson County Bar Association established this scholarship to honor the extraordinary legacy of attorney Thomas C. Locke, Lieutenant Colonel, USAR, and to inspire students to a life of service to country and their fellow citizens. Mr. Locke graduated from law school in 1978, and practiced law for 25 years as a military judge advocate and civilian attorney in Independence, Missouri.</p><p>Mr. Locke served 28 years of active and reserve military duty in the United States Army. His assignment at retirement was as Staff Judge Advocate for the 3rd Corps Support Command, where he supervised a staff of 12 attorneys and five legal specialists and provided legal advice to the Command on operational law, international law and military law.<br><br>At the time of his death, Mr. Locke was a shareholder and director of the Welch, Martin, Albano &amp; Manners, P.C. law firm in Independence, Missouri, where he devoted the majority of his practice to the representation of injured workers. He was a past Chairperson of the Workers’ Compensation Committee of the Kansas City Metropolitan Bar Association and a member of the Board of Directors of the Workplace Injury Litigation Group, a nationwide organization devoted to representing the interests of injured works. He also held leadership positions in the Lee’s Summit United Methodist Church and the Jackson County Law Library.<br></p>"
  },
  {
    "slug": "tile-contractors-association-of-america-inc-architectural-scholarship",
    "name": "Tile Contractors’ Association of America, Inc. Architectural Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages the Tile Contractors’ Association of America’s scholarships. Eligible applicants for the TCAA Architectural Scholarship must be pursuing a professional degree in architecture.</p><p>For more information, please visit the TCAA’s scholarship web page at <a href=\"https://www.tcaainc.org/scholarships\" target=\"_blank\" rel=\"noreferrer noopener\">www.tcaainc.org/scholarships</a>.</p>"
  },
  {
    "slug": "tile-contractors-association-of-america-inc-family-scholarship",
    "name": "Tile Contractors' Association of America, Inc. Family Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>Truman Heartland Community Foundation manages the Tile Contractors’ Association of America’s scholarships. Eligible applicants for the TCAA Family Scholarship must be qualified employees or family members of qualified employees of TCAA contractor companies.<br><br>For more information, please visit the TCAA’s scholarship web page at <a href=\"https://www.tcaainc.org/scholarships\" target=\"_blank\" rel=\"noreferrer noopener\">www.tcaainc.org/scholarships</a>.</p>"
  },
  {
    "slug": "timothy-lutheran-church-betty-wilson-scholarship",
    "name": "Timothy Lutheran Church Betty Wilson Scholarship",
    "eligibility": [
      "Must be a member of Timothy Lutheran Church in Blue Springs, MO with a minimum 50% attendance at worship services as a family;",
      "Must attend or be enrolled in Lutheran High School in Kansas City or St. Paul Lutheran High School in Concordia, MO;",
      "Must have a 2.5 or equivalent GPA."
    ],
    "amount": "To be determined based on number of applicants and endowment funds available.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the applicant continues to meet the above eligibility criteria. An application must be submitted annually."
    },
    "deadline": "Applications must be submitted by June 1.",
    "requirements": [],
    "description": "<p>Timothy Lutheran Church established this scholarship to serve as a living memorial to Betty Wilson, a member of the church from 1962 until her death in 1991. This scholarship is intended to support students attending Lutheran High School in Kansas City or St. Paul Lutheran High School in Concordia, MO.</p><p></p>"
  },
  {
    "slug": "timothy-lutheran-church-brenda-rapp-west-scholarship",
    "name": "Timothy Lutheran Church Brenda Rapp West Scholarship",
    "eligibility": [
      "Must be a member of Timothy Lutheran Church in Blue Springs, MO, with a minimum 50% attendance at worship services as a family;",
      "Must be enrolled in Timothy Lutheran School for the upcoming school year;",
      "Must be in at least 2nd grade;",
      "Must have satisfactory/passing grades in 1st grade or 2.5 or equivalent GPA for those applying for 3rd through 8th grade."
    ],
    "amount": "To be determined based on number of applicants and endowment funds available.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the applicant continues to meet the above eligibility criteria. A full application must be submitted annually."
    },
    "deadline": "Applications must be submitted by June 1.",
    "requirements": [],
    "description": "<p>Ms. Brenda Rapp West established this scholarship to support students pursuing Christian Education at Timothy Lutheran Church.</p><p></p>"
  },
  {
    "slug": "timothy-lutheran-church-rose-mary-thompson-scholarship",
    "name": "Timothy Lutheran Church Rose Mary Thompson Scholarship",
    "eligibility": [
      "Must be a member of Timothy Lutheran Church in Blue Springs, MO, with a minimum 50% attendance at worship services as a family;",
      "Must be enrolled in Timothy Lutheran School for the upcoming school year;",
      "Must be in at least 2nd grade;",
      "Must have satisfactory/passing grades in 1st grade or 2.5 or equivalent GPA for those applying for 3rd through 8th grade."
    ],
    "amount": "To be determined based on number of applicants and endowment funds available.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the applicant continues to meet the above eligibility criteria. A full application must be submitted annually."
    },
    "deadline": "Applications must be submitted by June 1.",
    "requirements": [],
    "description": "<p>Timothy Lutheran Church established this scholarship as a memorial to Rose Mary Thompson.</p><p></p>"
  },
  {
    "slug": "timothy-lutheran-church-theodore-v-schubkegel-scholarship",
    "name": "Timothy Lutheran Church Theodore V. Schubkegel Scholarship",
    "eligibility": [
      "Must be a member of Timothy Lutheran Church in Blue Springs, MO with a minimum 50% attendance at worship services as a family;",
      "Must be enrolled in Timothy Lutheran School for the upcoming school year;",
      "Must be in at least 2nd grade;",
      "Must have satisfactory/passing grades in 1st grade or 2.5 or equivalent GPA for those applying for 3rd through 8th grade."
    ],
    "amount": "To be determined based on number of applicants and endowment funds available.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the applicant continues to meet the above eligibility criteria. An application must be submitted annually."
    },
    "deadline": "Applications must be submitted by June 1.",
    "requirements": [],
    "description": "<p>Timothy Lutheran Church established this scholarship to serve as a living memorial to Theodore V. Schubkegel, whom the Lord called as Pastor to serve Timothy Lutheran Church from 1998 until his death in 2014. This scholarship is intended to support students attending Timothy Lutheran School.</p><p></p>"
  },
  {
    "slug": "timothy-lutheran-church-william-p-gerike-scholarship",
    "name": "Timothy Lutheran Church William P. Gerike Scholarship",
    "eligibility": [
      "Must be preparing for full-time LCMS church work on a college level as a pastor, teacher, director of Christian education, church musician, or school administrator;",
      "Must have a 2.5 GPA or equivalent;",
      "Applicant is not required to be a member of Timothy Lutheran Church; however, priority will be given to Timothy Lutheran Church members, then to members of Shepherd of the Valley Lutheran Church in Oak Grove, then to members of sister LCMS congregations, and then to members of other Lutheran congregations;",
      "Priority will be given to those pursuing degrees at Lutheran colleges or universities; however, others may be considered."
    ],
    "amount": "Up to $2,500.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for additional years of funding if the applicant continues to meet the above eligibility criteria. An application must be submitted annually."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal essay of approximately 500 words about yourself and why you desire to go into full-time church work.",
      "Personal reference from your pastor."
    ],
    "description": "<p>Timothy Lutheran Church established this scholarship to serve as a living memorial to William P. Gerike, whom the Lord called as Pastor to serve Timothy Lutheran Church from its beginning in 1962 until his death in 1981. This scholarship is intended to support students preparing for full-time Lutheran Church Missouri Synod (LCMS) church work.</p><p></p>"
  },
  {
    "slug": "toni-thornton-aauw-re-entry-scholarship",
    "name": "Toni Thornton AAUW Re-Entry Scholarship",
    "eligibility": [],
    "amount": "",
    "renewable": {
      "isRenewable": false,
      "details": ""
    },
    "deadline": "",
    "requirements": [],
    "description": "<h3><strong>Sponsored by American Association of University Women Greater Kansas City Interbranch Council</strong></h3><p>Eligible applicants must be:</p><ul><li>Women returning to complete their undergraduate degrees after having been out of school for at least five years</li><li>Must have been full-time or part-time students within the last six months</li><li>Must have completed a minimum of 30 credit hours, 15 of which must have been completed since re-entry.</li></ul>"
  },
  {
    "slug": "venable-scholarship",
    "name": "Venable Scholarship",
    "eligibility": [
      "Must be a graduating senior from a Kansas City metro-area high school;",
      "Must be an active member of a Christian church.",
      "Must be pursuing an undergraduate degree in business or engineering at an accredited Christian college or university in the US or state college or university in Missouri or Kansas.",
      "Must be enrolled in high school classes to prepare for intended major and maintaining a 3.0 GPA in those classes with a minimum 2.5 GPA overall.",
      "Preference may be given to students attending Christian colleges and universities holding membership in or accredited by the Council for Christian Colleges and Universities (CCCU), International Alliance for Christian Education (IACE), or the Association for Biblical Higher Education (ABHE).",
      "Preference may be given to candidates who have employment history during the school year and/or during the summer."
    ],
    "amount": "Up to $7,000 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment, participation in a campus ministry program, and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Provide an essay of 500 words or less about yourself, your home church, your faith and participation in church and mission/ministry work, your educational and career goals, and your knowledge/understanding of Business as Mission and its use in completing the Great Commission. For more information, read Matthew 28:18-20 and Revelations 7:9, check these websites: https://businessasmission.com/start/, https://lausanne.org/networks/issues/business-as-mission and https://aggrandizeglobal.com/our-work, and ask mission leaders at your church."
    ],
    "description": "<p>The Signatry established this scholarship at the direction of the Venable family to help develop future Christian leaders and to inform and educate Christian students embarking on a business or engineering college education about the Business as Mission (BAM) movement and the use of business as a tool for completing the Great Commission.</p><p></p>"
  },
  {
    "slug": "vern-and-ruthel-sinclair-memorial-music-scholarship",
    "name": "Vern and Ruthel Sinclair Memorial Music Scholarship",
    "eligibility": [
      "Must be a graduating senior from Center Place Restoration School or a public high school in the Blue Springs, Fort Osage, Grain Valley, Independence, Lee's Summit, Oak Grove, or Raytown school districts;",
      "Must be pursuing an undergraduate degree in music, music education, music performance, music therapy, or church music at any accredited four-year college or university;",
      "Must have a minimum cumulative GPA of 3.0;",
      "Must have demonstrated involvement in music and community service activities;",
      "Preference may be given to members of the RLDS Restoration Church."
    ],
    "amount": "Up to $1,200 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "This is not a renewable scholarship."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "A brief statement about your involvement with the RLDS Restoration Church (Involvement is not required to received this scholarship; however, preference may be given to members)",
      "A reference letter from a supervisor of an activity that is included in the resume submitted as part of the application."
    ],
    "description": "<p>Music was Vern Sinclair’s passion and a part of his life starting as a young boy. He was an accomplished musician with a Master of Music degree in organ and French horn from the University of Michigan. Vern directed bands and choirs, taught private lessons, played in the Independence Symphony Orchestra (now Heritage Philharmonic) for 60 years, and occasionally joined the Kansas City Symphony at the Starlight Theatre. Vern also played the organ for his church for 60 years. Vern was supported in his life-long musical endeavors by his wife, Ruthel. This scholarship was established by their family to honor their memory and musical legacy.</p><p></p>"
  },
  {
    "slug": "vita-m-totta-memorial-scholarship",
    "name": "Vita M. Totta Memorial Scholarship",
    "eligibility": [
      "Must be admitted to Nativity of Mary School for seventh grade;",
      "Must have demonstrated financial need."
    ],
    "amount": "Up to $500 per academic year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not a renewable scholarship. Previous recipients may apply again."
    },
    "deadline": "",
    "requirements": [],
    "description": "<p>The Vita M. Totta Memorial Scholarship Fund for Nativity of Mary Catholic School Scholarship was established by the Totta family as an enduring memorial and legacy for Vita M. Totta. The scholarship supports seventh grade students at Nativity of Mary Catholic School with demonstrated financial need.</p><p></p>"
  },
  {
    "slug": "walters-magee-scholarship",
    "name": "Walters-Magee Scholarship",
    "eligibility": [
      "Must be a graduating senior from a Kansas City metro-area high school;",
      "Must be an active member of a Christian church;",
      "Must have demonstrated financial need;",
      "Must have community service experience;",
      "Must have a solid \"C\" (2.0) or higher cumulative high school GPA;",
      "Must be pursuing an undergraduate degree in education or psychology at any accredited junior college, college or university."
    ],
    "amount": "Up to $5,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 2.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades through Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Church affiliation including: Name of church you attend and mailing address, Pastor's name and contact information.",
      "Personal essay of approximately 500 words addressing your faith, how it has influenced your career plans, and how you believe your career will make the world better.",
      "Personal reference from your pastor.",
      "Personal reference from a coach, family friend, or someone you believe can speak to your character best.",
      "Another personal reference, if you choose."
    ],
    "description": "<p>The Signatry, A Global Christian Foundation, established this scholarship with a bequest from the Walters-Magee family to benefit Christian students from the Kansas City metro area who are pursuing undergraduate degrees in psychology or education.</p><p></p>"
  },
  {
    "slug": "watkins-family-harbinger-scholarship",
    "name": "Watkins Family Harbinger Scholarship",
    "eligibility": [
      "Must be a graduating senior from Raytown or Raytown South High School;",
      "Must be a first-generation college student;",
      "Must have demonstrated financial need;",
      "Must have demonstrated perseverance;",
      "Must qualify for Advanced Diploma Path 1 or 2;",
      "Must be pursuing an undergraduate degree at any accredited junior college, college, or university."
    ],
    "amount": "Up to $1,200 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Personal essay - Harbinger: \"A person, object or event heralding the future.\" \"A forerunner\" \"Something that comes before and shows what will be the future.\" As the first person from your family to attend an institution of higher learning, you represent the hopes and dreams of what will come later. In 350-500 words describe what it means to be the first from your family to go to college.",
      "Two personal references from a teacher, coach, family friend, whomever you believe can speak to your character best."
    ],
    "description": "<p>This scholarship was established by Michael and Mary Jo (Jody) Watkins to benefit first-generation college students graduating from Raytown School District high schools. Dr. and Mrs. Watkins were both educators in the Raytown School District during their careers. Dr. Watkins was Superintendent from 1996 – 2001, and Mrs. Watkins taught at Robinson Elementary School for 16 years.</p><p></p>"
  },
  {
    "slug": "wendall-j-and-myrna-j-olson-student-assistance-scholarship",
    "name": "Wendall J. and Myrna J. Olson Student Assistance Scholarship",
    "eligibility": [
      "Must be an active member in good standing at St. Paul’s Lutheran Church in Concordia, Missouri;",
      "Must be a graduating high school senior; a part-time or full-time student in good academic standing at State Fair Community College in Sedalia, Missouri, University of Central Missouri in Warrensburg, Missouri, any Lutheran Church-Missouri Synod affiliated post-secondary institution located in Missouri, Kansas, Iowa, Illinois, Arkansas, Minnesota, Nebraska or Indiana; or any vocational training institution in Missouri;",
      "Must demonstrate good character, leadership and service."
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 2.5."
    },
    "deadline": "Applications must be submitted by March 15.",
    "requirements": [],
    "description": "<p>This scholarship was made possible by way of a gift from Wendell and Myrna Olson of Concordia, Missouri.</p><p></p>"
  },
  {
    "slug": "william-chrisman-class-of-1953-scholarship",
    "name": "William Chrisman Class of 1953 Scholarship",
    "eligibility": [
      "Must be a graduating senior from William Chrisman High School in Independence, Missouri;",
      "Must be pursuing an undergraduate degree at an accredited junior college, college or university;",
      "Must be in the top 25% of graduating class (applicants for vocational schools need not meet the 25% requirement);",
      "Must have demonstrated financial need;",
      "Must have demonstrated participation in community service activities;",
      "Must have demonstrated participation in extra-curricular activities;",
      "Must have excellent written communication skills."
    ],
    "amount": "Up to $3,000 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 3.0.",
    "renewable": {
      "isRenewable": false,
      "details": "Amount:Up to $3,000 per academic year.Renewable:Yes, this scholarship can be renewed for three additional years of funding. A renewal application must be submitted with proof of continuing college enrollment and a minimum cumulative college GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered."
    ],
    "description": "<p>The William Chrisman Class of 1953 established this scholarship for the benefit of graduating William Chrisman High School seniors.<br></p>"
  },
  {
    "slug": "william-g-lueckenhoff-memorial-scholarship",
    "name": "William G. Lueckenhoff Memorial Scholarship",
    "eligibility": [
      "Must be a student at St. Michael the Archangel High School in Lee’s Summit, MO;",
      "Must have demonstrated financial need;",
      "Must have a 2.5 or equivalent GPA."
    ],
    "amount": "Up to $3,000 per year.",
    "renewable": {
      "isRenewable": false,
      "details": "Not renewable; previous recipients may apply again."
    },
    "deadline": "",
    "requirements": [
      "A typed essay of approximately 500 words elaborating on your personal qualities and goals for the future.",
      "A reference letter from a current faculty member, advisor or activity sponsor."
    ],
    "description": "<p>The William G. Lueckenhoff Memorial Scholarship was established by the Lueckenhoff family in honor of William Lueckenhoff. Will was born May 27th, 1954 in New York City and then moved to Kansas City as a young boy. He attended St. Bernadette School, O'Hara High School, Southwest Missouri State University and UMKC Law School. Will played varsity football at Southwest Missouri as a starter on the defensive line. He later played rugby at a high level in Kansas City and Chicago. After graduation from law school, Will followed in his father's footsteps and joined the FBI as a Special Agent. He served in the FBI for 25 years, holding many different positions across the country. After retiring from the FBI, Will worked in a number of private sector security positions including more than two years in Iraq as a law enforcement advisor to the military.</p><p>After many years of career-driven relocations, Will and his wife Trina chose to return to their beloved hometown of Kansas City. While in Kansas City, Will worked for Catholic Charities and later as a private investigator. Will was an active parishioner of St. Bernadette's Catholic Church and was a member of the Ancient Order of Hibernians. Will was known for his generosity and his determination to help others in need. This scholarship seeks to continue Will’s legacy of generosity and his commitment to the Catholic faith by providing tuition assistance to students at St. Michael the Archangel High School in Lee’s Summit, MO. Will and his wife Trina had a keen interest in supporting St. Michael the Archangel High School since it is near their home in Lee’s Summit and Will had graduated from O’Hara High School and Trina from St. Mary’s High School. With the closing of these two high schools, St. Michael’s as the new Catholic High School in the area seeks to carry on the traditions of O’Hara and St. Mary’s.</p><p></p>"
  },
  {
    "slug": "william-r-gann-music-scholarship",
    "name": "William R. Gann Music Scholarship",
    "eligibility": [
      "Must be a graduating high school senior or past graduate from any high school in Jackson County, MO or Lafayette County, MO.",
      "Must be pursuing an undergraduate or graduate degree in music or music education (if no music applications are received, nursing majors may be considered);",
      "Must have a minimum cumulative GPA of 3.0"
    ],
    "amount": "Up to $1,000 per academic year.",
    "renewable": {
      "isRenewable": true,
      "details": "Yes, this scholarship can be renewed for three additional years of funding if the student continues to meet the criteria for the scholarship. A renewal application must be submitted with proof of continuing college enrollment and a minimum college cumulative GPA of 3.0."
    },
    "deadline": "The General Application for the 2026-2027 cycle will be available December 1, 2025 and due February 16, 2026 (including any requirements listed below).",
    "requirements": [
      "Transcripts showing grades from Fall Semester 2025. Any applications submitted with transcripts omitting Fall Semester 2025 will not be considered.",
      "Essay: Please submit an essay of approximately 500 words detailing your goals and aspirations for utilizing your music degree. If you are a music education major, please include details about your interest in education.",
      "Letter of Recommendation: Please submit a letter of recommendation from a music teacher (either from school or private lessons) who can attest to your musical abilities and leadership capabilities.",
      "ACT or SAT Score documentation"
    ],
    "description": "<p>This scholarship was established by William R. Gann to support and encourage students pursuing degrees and careers in music and music education. Though Mr. Gann’s career path extended into other fields including counseling, academic leadership, and genealogical research, he majored in music theory and acknowledges the importance his musical education and teachers played in his success. It is Mr. Gann’s hope to support the education of other musicians and music teachers.</p><p></p>"
  }
]
